{
    "tags": [],
    "strength": "3",
    "dexterity": "15",
    "constitution": "16",
    "intelligence": "4",
    "wisdom": "11",
    "charisma": "6",
    "name": "Gingwatzim",
    "AC": 12,
    "speed": [
        "30 ft",
        "fly 30 ft. (hover) in its true form only"
    ],
    "saving_throws": {},
    "skills": {},
    "damage_immunities": [
        "poison"
    ],
    "condition_immunities": [
        "poisoned"
    ],
    "senses": [
        "blindsight 60 ft. (blind beyond this radius)",
        "passive Perception 10"
    ],
    "languages": [
        "telepathy 60 ft."
    ],
    "CR": "2 (450 XP)",
    "page": 27,
    "book": "Candlekeep Mysteries",
    "traits": {
        "Alternate Forms": "The gingwatzim has two alternate forms, both of which are chosen by its creator when the gingwatzim comes into being. One form is an exact duplicate of a Tiny nonmagical object (such as a book, dagger, or gemstone) that its creator is carrying or wearing when the gingwatzim is conjured. The other form can be any Tiny beast. Once these alternate forms are chosen, they can't be changed."
    },
    "actions": {
        "Energy Drain (True Form Only)": "Melee Weapon Attack: +4+1d4 + 2 to hit, reach 5 ft., one creature. Hit: 16 (4d6 + 2) necrotic damage, and the target must succeed on a DC 12+1d4 + 10 Constitution saving throw or gain 1 level of exhaustion. When the target finishes a short or long rest, the target loses every level of exhaustion gained from this attack.",
        "Change Shape": "The gingwatzim changes from its true formxe2x80x94a 3-foot-diameter sphere of luminous ectoplasmxe2x80x94into one of its two alternate forms, or from one of those forms back into its true form. In object form, it can't move or make attacks but otherwise retains its statistics, and it is indistinguishable from the thing it is imitating. In beast form, it retains its hit points but otherwise uses the stat block of the beast it is imitating. When it dies, the gingwatzim reverts to its true form and then vanishes."
    },
    "legendary_actions": {
        "number": 0,
        "options": {}
    }
}