{
    "tags": [],
    "strength": "24",
    "dexterity": "13",
    "constitution": "26",
    "intelligence": "27",
    "wisdom": "22",
    "charisma": "25",
    "arcana": "+22",
    "perception": "+13",
    "name": "Greater Star Spawn Emissary",
    "AC": 15,
    "speed": [
        "40 ft",
        "fly 40 ft. (hover)"
    ],
    "saving_throws": {
        "constitution": "proficient",
        "intelligence": "proficient",
        "wisdom": "proficient",
        "charisma": "proficient"
    },
    "skills": {
        "arcana": "expert",
        "perception": "proficient"
    },
    "resistances": [
        "acid, force, necrotic, psychic"
    ],
    "condition_immunities": [
        "charmed, frightened"
    ],
    "senses": [
        "truesight 120 ft.",
        "passive Perception 23"
    ],
    "languages": [
        "all",
        "telepathy 1",
        "000 ft."
    ],
    "CR": "21 (33,000 XP)",
    "page": 245,
    "book": "Van Richten\\xe2\\x80\\x99s Guide to Ravenloft",
    "traits": {
        "Legendary Resistance (4/Day)": "If the emissary fails a saving throw, it can choose to succeed instead.",
        "Unusual Nature": "The emissary doesn't require air, food, drink, or sleep."
    },
    "actions": {
        "Multiattack": "The emissary makes three attacks.",
        "Lashing Maw": "Melee Weapon Attack: +14+1d14 + 7 to hit, reach 15 ft., one target. Hit: 20 (2d10 + 7) piercing damage plus 13 (3d8) acid damage.",
        "Psychic Orb": "Ranged Spell Attack: +15+1d14 + 8 to hit, range 120 ft., one creature. Hit: 27 (3d12 + 8) psychic damage.",
        "Unearthly Bile (Recharge 5xe2x80x936)": "The emissary expels bile that splashes all creatures in a 30-foot-radius sphere centered on a point within 120 feet of the emissary. Each creature in that area must make a DC 23+1d14 + 16 Dexterity saving throw, taking 55 (10d10) acid damage on a failed save, or half as much damage on a successful one. For each creature that fails the saving throw, a gibbering mouther (see its entry in the Monster Manual) appears in an unoccupied space on a surface that can support it within 30 feet of that creature. The gibbering mouthers act right after the emissary on the same initiative count, gaining a +7 bonus to their attack and damage rolls, and fighting until they are destroyed. They disappear when the emissary dies."
    },
    "legendary_actions": {
        "number": 3,
        "options": {
            "Attack": " The emissary teleports up to 30 feet to an unoccupied space it can see and makes one attack.",
            "Warp Space (Costs 2 Actions)": " The emissary causes the ground in a 20-foot square that it can see within 90 feet of it to turn into teeth and maws until the start of its next turn. The area becomes difficult terrain for the duration. Any creature takes 10 (3d6) piercing damage for each 5 feet it moves on this terrain.",
            "Mind Cloud (Costs 3 Actions)": " The emissary unleashes a psychic wave. Each creature within 30 feet of the emissary must succeed on a DC 23+1d14 + 16 Wisdom saving throw or take 32 (5d12) psychic damage. In addition, every spell ends on creatures and objects of the emissary's choice in that area."
        }
    }
}