{
    "tags": [],
    "strength": "22",
    "dexterity": "12",
    "constitution": "22",
    "intelligence": "8",
    "wisdom": "15",
    "charisma": "16",
    "perception": "+6",
    "survival": "+6",
    "name": "Relentless Juggernaut",
    "AC": 17,
    "speed": [
        "30 ft"
    ],
    "saving_throws": {
        "dexterity": "proficient",
        "wisdom": "proficient",
        "charisma": "proficient"
    },
    "skills": {
        "perception": "proficient",
        "survival": "proficient"
    },
    "condition_immunities": [
        "charmed, exhaustion, frightened"
    ],
    "senses": [
        "darkvision 120 ft.",
        "passive Perception 16"
    ],
    "languages": [
        "understands all languages but can\\'t speak"
    ],
    "CR": "12 (8,400 XP)",
    "page": 243,
    "book": "Van Richten\\xe2\\x80\\x99s Guide to Ravenloft",
    "traits": {
        "Legendary Resistance (3/Day)": "If the juggernaut fails a saving throw, it can choose to succeed instead.",
        "Regeneration": "The juggernaut regains 20 hit points at the start of its turn. If the juggernaut takes radiant damage, this trait doesn't function at the start of its next turn. The juggernaut dies only if it starts its turn with 0 hit points and doesn't regenerate.",
        "Unusual Nature": "The juggernaut doesn't require air, food, drink, or sleep."
    },
    "actions": {
        "Multiattack": "The juggernaut makes two attacks. It can replace one attack with Deadly Shaping if it is ready.",
        "Executioner's Pick": "Melee Weapon Attack: +10+1d8 + 6 to hit, reach 5 ft., one target. Hit: 17 (2d10 + 6) piercing damage, and if the target is a creature, its speed is reduced by 10 feet until the start of the juggernaut's next turn.",
        "Fist": "Melee Weapon Attack: +10+1d8 + 6 to hit, reach 5 ft., one target. Hit: 11 (1d10 + 6) bludgeoning damage, and if the target is a Large or smaller creature, it must succeed on a DC 18+1d8 + 14 Strength saving throw or be knocked prone.",
        "Deadly Shaping (Recharge 5xe2x80x936)": "The juggernaut magically shapes a feature of its surroundings into a deadly implement. A creature the juggernaut can see within 60 feet of it must make a DC 18+1d8 + 14 Dexterity saving throw. If the saving throw fails, the targeted creature is struck by one of the following (juggernaut's choice):",
        "Flying Stone": "The target takes 22 (5d8) bludgeoning damage and is incapacitated until the start of the juggernaut's next turn, and the implement vanishes.",
        "Scything Shrapnel": "The target takes 14 (4d6) slashing damage, and the implement vanishes. At the start of each of its turns, the target takes 10 (3d6) necrotic damage from the wound left by the shrapnel. The wound ends if the target regains any hit points or if a creature uses an action to stanch the wound, which requires a successful DC 15+1d8 + 11 Wisdom (Medicine) check."
    },
    "legendary_actions": {
        "number": 3,
        "options": {
            "Implacable Advance": " The juggernaut moves up to its speed, ignoring difficult terrain. Any object in its path takes 55 (10d10) bludgeoning damage if it isn't being worn or carried.",
            "Rapid Shaping (Costs 3 Actions)": " The juggernaut recharges Deadly Shaping and uses it."
        }
    }
}