{
    "tags": [],
    "hit points": "18d12 + 126",
    "strength": "27 (+8)",
    "dexterity": "10 (+0)",
    "constitution": "25 (+7)",
    "intelligence": "16 (+3)",
    "wisdom": "13 (+1)",
    "charisma": "21 (+5)",
    "dexterity save": "+5",
    "constitution save": "+12",
    "wisdom save": "+6",
    "charisma save": "+10",
    "arcana": "+8",
    "history": "+8",
    "perception": "+11",
    "stealth": "+5",
    "name": "Adult Silver Dragon",
    "AC": 19,
    "speed": [
        "40 ft",
        "fly 80 ft"
    ],
    "saving_throws": {
        "dexterity": "proficient",
        "constitution": "proficient",
        "wisdom": "proficient",
        "charisma": "proficient"
    },
    "skills": {
        "arcana": "proficient",
        "history": "proficient",
        "perception": "expert",
        "stealth": "proficient"
    },
    "damage_immunities": [
        "cold"
    ],
    "senses": [
        "blindsight 60 ft.",
        "darkvision 120 ft.",
        "passive Perception 21"
    ],
    "languages": [
        "Common",
        "Draconic"
    ],
    "CR": "variable",
    "page": 117,
    "book": "Monster Manual",
    "traits": {
        "Legendary Resistance (3/Day)": "If the dragon fails a saving throw, it can choose to succeed instead."
    },
    "actions": {
        "Multiattack": "The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws.",
        "Bite": "Melee Weapon Attack: +13+1d10 + 8 to hit, reach 10 ft., one target. Hit: 19 (2d10 + 8) piercing damage.",
        "Claw": "Melee Weapon Attack: +13+1d10 + 8 to hit, reach 5 ft., one target. Hit: 15 (2d6 + 8) slashing damage.",
        "Tail": "Melee Weapon Attack: +13+1d10 + 8 to hit, reach 15 ft., one target. Hit: 17 (2d8 + 8) bludgeoning damage.",
        "Frightful Presence": "Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 18+1d10 + 13 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours.",
        "Breath Weapons (Recharge 5–6)": "The dragon uses one of the following breath weapons.",
        "Change Shape": "The dragon magically polymorphs into a humanoid or beast that has a challenge rating no higher than its own, or back into its true form. It reverts to its true form if it dies. Any equipment it is wearing or carrying is absorbed or borne by the new form (the dragon's choice)."
    },
    "legendary_actions": {
        "number": 3,
        "options": {
            "Detect": " The dragon makes a Wisdom (Perception) check.",
            "Tail Attack": " The dragon makes a tail attack.",
            "Wing Attack (Costs 2 Actions)": " The dragon beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 22+1d10 + 17 Dexterity saving throw or take 15 (2d6 + 8) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed."
        }
    },
    "in_lair": {
        "CR_increase": 1,
        "actions": [
            "The dragon creates fog as if it had cast the fog cloud spell. The fog lasts until initiative count 20 on the next round.",
            "A blisteringly cold wind blows through the lair near the dragon. Each creature within 120 feet of the dragon must succeed on a DC 15+1d10 + 10 Constitution saving throw or take 5 (1d10) cold damage. Gases and vapors are dispersed by the wind, and unprotected flames are extinguished. Protected flames, such as lanterns, have a 50 percent chance of being extinguished."
        ]
    },
    "alignment": "LG",
    "size": "Huge",
    "type": "dragon"
}