{
    "tags": [],
    "hit points": "17d8 + 68",
    "strength": "20 (+5)",
    "dexterity": "15 (+2)",
    "constitution": "19 (+4)",
    "intelligence": "15 (+2)",
    "wisdom": "21 (+5)",
    "charisma": "18 (+4)",
    "constitution save": "+9",
    "wisdom save": "+10",
    "charisma save": "+9",
    "insight": "+10",
    "perception": "+10",
    "name": "Archon of the Triumvirate",
    "HP": "144 (17d8 + 68)",
    "AC": 18,
    "speed": [
        "30 ft"
    ],
    "saving_throws": {
        "constitution": "proficient",
        "wisdom": "proficient",
        "charisma": "proficient"
    },
    "skills": {
        "insight": "proficient",
        "perception": "proficient"
    },
    "resistances": [
        "bludgeoning, piercing, and slashing from nonmagical attacks"
    ],
    "condition_immunities": [
        "charmed, exhaustion, frightened"
    ],
    "senses": [
        "darkvision 120 ft.",
        "passive Perception 20"
    ],
    "languages": [
        "all"
    ],
    "CR": "14 (11,500 XP)",
    "page": 192,
    "book": "Guildmasters’ Guide to Ravnica",
    "traits": {
        "Eye of the Law": "As a bonus action, the archon can target a creature it can see within 120 feet of it and determine which laws that creature has broken in the last 24 hours.",
        "spellcasting": {
            "type": "innate",
            "spells": [
                "calm emotions",
                "command",
                "compelled duel"
            ]
        },
        "Mount": "If the archon isn't mounted, it can use a bonus action to magically teleport onto the creature serving as its mount, provided the archon and its mount are on the same plane of existence. When it teleports, the archon appears astride the mount along with any equipment it is wearing or carrying. While mounted and not incapacitated, the archon can't be surprised, and both it and its mount gain advantage on Dexterity saving throws. If the archon is reduced to 0 hit points while riding its mount, the mount is reduced to 0 hit points as well."
    },
    "actions": {
        "Multiattack": "The archon makes two Hammer of Justice attacks.",
        "Hammer of Justice": "Melee Weapon Attack: +10+1d10 + 5 to hit, reach 5 ft., one target. Hit: 12 (2d6 + 5) bludgeoning damage plus 18 (4d8) force damage. If the target is a creature, it must succeed on a DC 18+1d10 + 13 Strength saving throw or be knocked prone.",
        "Pacifying Presence": "Each creature of the archon's choice that the archon can see within 120 feet of it must succeed on a DC 18+1d10 + 13 Wisdom saving throw, or else the target drops any weapons it is holding, ends its concentration on any spells or other effects, and becomes charmed by the archon for 1 minute. The charmed creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the archon's Pacifying Presence for the next 24 hours."
    },
    "legendary_actions": {
        "number": 3,
        "options": {
            "Rejoin Mount": " If the archon isn't mounted, it magically teleports to its steed and mounts it as long as the archon and its steed are on the same plane of existence.",
            "Smite (Costs 2 Actions)": " The archon makes a Hammer of Justice attack, and then its mount can use its reaction to make a melee weapon attack.",
            "Detention (Costs 3 Actions)": " The archon targets a creature it can see within 60 feet of it. The target must succeed on a DC 18+1d10 + 13 Charisma saving throw or be magically teleported to a harmless demiplane until the end of the archon's next turn, whereupon the target reappears in the space it left or the nearest unoccupied space if that space is occupied."
        }
    },
    "alignment": "LN",
    "size": "Medium",
    "type": "celestial"
}