{
    "tags": [],
    "hit points": "8d10 + 40",
    "strength": "20 (+5)",
    "dexterity": "12 (+1)",
    "constitution": "20 (+5)",
    "intelligence": "11 (+0)",
    "wisdom": "14 (+2)",
    "charisma": "8 (-1)",
    "athletics": "+8",
    "stealth": "+7",
    "name": "Banderhobb",
    "HP": "84 (8d10 + 40)",
    "AC": 15,
    "speed": [
        "30 ft"
    ],
    "saving_throws": {},
    "skills": {
        "athletics": "proficient",
        "stealth": "expert"
    },
    "condition_immunities": [
        "charmed, frightened"
    ],
    "senses": [
        "darkvision 120 ft.",
        "passive Perception 12"
    ],
    "languages": [
        "Common and the languages of its creator but can't speak"
    ],
    "CR": "5 (1,800 XP)",
    "page": 122,
    "book": "Volo’s Guide to Monsters",
    "traits": {
        "Resonant Connection": "If the banderhobb has even a tiny piece of a creature or an object in its possession, such as a lock of hair or a splinter of wood, it knows the most direct route to that creature or object if it is within 1 mile of the banderhobb.",
        "Shadow Stealth": "While in dim light or darkness, the banderhobb can take the Hide action as a bonus action."
    },
    "actions": {
        "Bite": "Melee Weapon Attack: +8+1d6 + 5 to hit, reach 5 ft., one target. Hit: 22 (5d6 + 5) piercing damage, and the target is grappled (escape DC 15+1d6 + 12) if it is a Large or smaller creature. Until this grapple ends, the target is restrained, and the banderhobb can't use its bite attack or tongue attack on another target.",
        "Tongue": "Melee Weapon Attack: +8+1d6 + 5 to hit, reach 15 ft., one target. Hit: 10 (3d6) necrotic damage, and the target must make a DC 15+1d6 + 12 Strength saving throw. On a failed save, the target is pulled to a space within 5 feet of the banderhobb, which can use a bonus action to make a bite attack against the target.",
        "Swallow": "The banderhobb makes a bite attack against a Medium or smaller creature it is grappling. If the attack hits, the target is swallowed, and the grapple ends. The swallowed creature is blinded and restrained, it has total cover against attacks and other effects outside the banderhobb and it takes 10 (3d6) necrotic damage at the start of each of the banderhobb's turns. A creature reduced to 0 hit points in this way stops taking necrotic damage and becomes stable.",
        "Shadow Step": "The banderhobb magically teleports up to 30 feet to an unoccupied space of dim light or darkness that it can see. Before or after teleporting, it can make a bite or tongue attack."
    },
    "alignment": "NE",
    "size": "Large",
    "type": "monstrosity"
}