{
    "tags": [
        "demon"
    ],
    "strength": "30",
    "dexterity": "14",
    "constitution": "26",
    "intelligence": "18",
    "wisdom": "24",
    "charisma": "16",
    "intimidation": "+17",
    "perception": "+14",
    "name": "Baphomet",
    "HP": "275 (19d12 + 152)",
    "AC": 22,
    "speed": [
        "40 ft"
    ],
    "saving_throws": {
        "dexterity": "proficient",
        "constitution": "proficient",
        "wisdom": "proficient"
    },
    "skills": {
        "intimidation": "expert",
        "perception": "proficient"
    },
    "damage_immunities": [
        "poison",
        "bludgeoning, piercing, and slashing from nonmagical attacks"
    ],
    "resistances": [
        "cold, fire, lightning"
    ],
    "condition_immunities": [
        "charmed, exhaustion, frightened, poisoned"
    ],
    "senses": [
        "truesight 120 ft.",
        "passive Perception 24"
    ],
    "languages": [
        "all",
        "telepathy 120 ft."
    ],
    "CR": "23 (50,000 XP)",
    "page": 143,
    "book": "Mordenkainen\\xe2\\x80\\x99s Tome of Foes",
    "traits": {
        "Charge": "If Baphomet moves at least 10 feet straight toward a target and then hits it with a gore attack on the same turn, the target takes an extra 16 (3d10) piercing damage. If the target is a creature, it must succeed on a DC 25+1d14 + 18 Strength saving throw or be pushed up to 10 feet away and knocked prone.",
        "spellcasting": {
            "type": "innate",
            "spells": [
                "detect magic",
                "dispel magic",
                "dominate beast",
                "hunter's mark",
                "maze",
                "wall of stone",
                "teleport"
            ]
        },
        "Labyrinthine Recall": "Baphomet can perfectly recall any path he has traveled, and he is immune to the maze spell.",
        "Legendary Resistance (3/Day)": "If Baphomet fails a saving throw, he can choose to succeed instead.",
        "Magic Resistance": "Baphomet has advantage on saving throws against spells and other magical effects.",
        "Magic Weapons": "Baphomet's weapon attacks are magical.",
        "Reckless": "At the start of his turn, Baphomet can gain advantage on all melee weapon attack rolls during that turn, but attack rolls against him have advantage until the start of his next turn."
    },
    "actions": {
        "Multiattack": "Baphomet makes three attacks: one with Heartcleaver, one with his bite, and one with his gore attack.",
        "Heartcleaver": "Melee Weapon Attack: +17+1d14 + 10 to hit, reach 15 ft., one target. Hit: 21 (2d10 + 10) slashing damage.",
        "Bite": "Melee Weapon Attack: +17+1d14 + 10 to hit, reach 10 ft., one target. Hit: 19 (2d8 + 10) piercing damage.",
        "Gore": "Melee Weapon Attack: +17+1d14 + 10 to hit, reach 10 ft., one target. Hit: 17 (2d6 + 10) piercing damage.",
        "Frightful Presence": "Each creature of Baphomet's choice within 120 feet of him and aware of him must succeed on a DC 18+1d14 + 11 Wisdom saving throw or become frightened for 1 minute. A frightened creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. These later saves have disadvantage if Baphomet is within line of sight of the creature."
    },
    "legendary_actions": {
        "number": 3,
        "options": {
            "Heartcleaver Attack": " Baphomet makes a melee attack with Heartcleaver.",
            "Charge (Costs 2 Actions)": " Baphomet moves up to his speed, then makes a gore attack."
        }
    },
    "in_lair": {
        "CR_increase": 1,
        "actions": [
            "Baphomet seals one doorway or other entryway within the lair. The opening must be unoccupied. It is filled with solid stone for 1 minute or until Baphomet creates this effect again.",
            "Baphomet chooses a room within the lair that is no larger in any dimension than 100 feet. Until the next initiative count 20, gravity is reversed within that room. Any creatures or objects in the room when this happens fall in the direction of the new pull of gravity, unless they have some means of remaining aloft. Baphomet can ignore the gravity reversal if he's in the room, although he likes to use this action to land on a ceiling to attack targets flying near it.",
            "Baphomet casts mirage arcane, affecting a room within the lair that is no larger in any dimension than 100 feet. The effect ends on the next initiative count 20."
        ]
    },
    "alignment": "CE",
    "size": "Huge",
    "type": "fiend"
}