{
    "tags": [],
    "strength": "10",
    "dexterity": "14",
    "constitution": "18",
    "intelligence": "17",
    "wisdom": "15",
    "charisma": "17",
    "perception": "+12",
    "name": "Beholder",
    "HP": "180 (19d10 + 76)",
    "AC": 18,
    "speed": [
        "0 ft",
        "fly 20 ft. (hover)"
    ],
    "saving_throws": {
        "intelligence": "proficient",
        "wisdom": "proficient",
        "charisma": "proficient"
    },
    "skills": {
        "perception": "expert"
    },
    "condition_immunities": [
        "prone"
    ],
    "senses": [
        "darkvision 120 ft.",
        "passive Perception 22"
    ],
    "languages": [
        "Deep Speech",
        "Undercommon"
    ],
    "CR": "13 (10,000 XP) or 14 (11,500 XP) whe ecoutered i lair",
    "page": 28,
    "book": "Monster Manual",
    "traits": {
        "Antimagic Cone": "The beholder's central eye creates an area of antimagic, as in the antimagic field spell, in a 150-foot cone. At the start of each of its turns, the beholder decides which way the cone faces and whether the cone is active. The area works against the beholder's own eye rays."
    },
    "actions": {
        "Bite": "Melee Weapon Attack: +5+1d10 + 0 to hit, reach 5 ft., one target. Hit: 14 (4d6) piercing damage.",
        "Eye Rays": "The beholder shoots three of the following magical eye rays at random (reroll duplicates), choosing one to three targets it can see within 120 feet of it:"
    },
    "legendary_actions": {
        "number": 3,
        "options": {
            "Eye Ray": " The beholder uses one random eye ray."
        }
    },
    "in_lair": {
        "CR_increase": 1,
        "actions": [
            "A 50-foot-square area of ground within 120 feet of the beholder becomes slimy; that area is difficult terrain until initiative count 20 on the next round.",
            "Walls within 120 feet of the beholder sprout grasping appendages until initiative count 20 on the round after next. Each creature of the beholder's choice that starts its turn within 10 feet of such a wall must succeed on a DC 15+1d10 + 10 Dexterity saving throw or be grappled. Escaping requires a successful DC 15+1d10 + 10 Strength (Athletics) or Dexterity (Acrobatics) check.",
            "An eye opens on a solid surface within 60 feet of the beholder. One random eye ray of the beholder shoots from that eye at a target of the beholder's choice that it can see. The eye then closes and disappears."
        ]
    },
    "alignment": "LE",
    "size": "Large",
    "type": "aberration"
}