{
    "tags": [],
    "strength": "13",
    "dexterity": "16",
    "constitution": "14",
    "intelligence": "12",
    "wisdom": "13",
    "charisma": "16",
    "nature": "+4",
    "perception": "+4",
    "stealth": "+6",
    "survival": "+4",
    "name": "Bheur Hag",
    "HP": "91 (14d8 + 28)",
    "AC": 17,
    "speed": [
        "30 ft"
    ],
    "saving_throws": {
        "wisdom": "proficient"
    },
    "skills": {
        "nature": "proficient",
        "perception": "proficient",
        "stealth": "proficient",
        "survival": "proficient"
    },
    "damage_immunities": [
        "cold"
    ],
    "senses": [
        "darkvision 60 ft.",
        "passive Perception 14"
    ],
    "languages": [
        "Auran",
        "Common",
        "Giant"
    ],
    "CR": "7 (2,900 XP) or 9 (5,000 XP) whe part of a cove",
    "page": 160,
    "book": "Volo\\xe2\\x80\\x99s Guide to Monsters",
    "traits": {
        "Graystaff Magic": "The hag carries a graystaff, a length of gray wood that is a focus for her inner power. She can ride the staff as if it were a broom of flying. While holding the staff, she can cast additional spells with her Innate Spellcasting trait (these spells are marked with an asterisk). If the staff is lost or destroyed, the hag must craft another, which takes a year and a day. Only a bheur hag can use a graystaff.",
        "Ice Walk": "The hag can move across and climb icy surfaces without needing to make an ability check. Additionally, difficult terrain composed of ice or snow doesn't cost her extra moment.",
        "spellcasting": {
            "ability": "charisma",
            "type": "innate",
            "spells": {
                "At": [
                    "hold person",
                    "ray of frost"
                ],
                "3/day": [
                    "cone of cold",
                    "ice storm",
                    "wall of ice"
                ],
                "1/day": [
                    "control weather"
                ]
            }
        }
    },
    "actions": {
        "Slam": "Melee Weapon Attack: +4+1d6 + 1 to hit, reach 5 ft., one target. Hit: 10 (2d8 + 1) bludgeoning damage plus 3 (1d6) cold damage.",
        "Maddening Feast": "The hag feasts on the corpse of one enemy within 5 feet of her that died within the past minute. Each creature of the hag's choice that is within 60 feet of her and able to see her must succeed on a DC 15+1d6 + 12 Wisdom saving throw or be frightened of her for 1 minute. While frightened in this way, a creature is incapacitated, can't understand what others say, can't read, and speaks only in gibberish; the DM controls the creature's movement, which is erratic. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the hag's Maddening Feast for the next 24 hours."
    },
    "in_lair": {
        "CR_increase": 1,
        "actions": [
            "Until initiative count 20 on the next round, the hag can pass through solid walls, doors, ceilings, and floors as if the surfaces weren't there.",
            "The hag targets any number of doors and windows that she can see, causing each one to either open or close as she wishes. Closed doors can be magically locked (requiring a successful DC 20+1d6 + 17 Strength check to force open) until she chooses to make them unlocked, or until she uses this lair action again to open them.",
            "The hag creates an illusory duplicate of herself, which appears in its own space. As long as she can see her duplicate, the hag can move it a distance equal to her walking speed as well as make the illusion speak on her turn (no action required). The illusion has the same statistics as the hag but can't take actions or reactions. It can interact with its environment and even pick up and hold real objects. The illusion seems real in every way but disappears if it takes any amount of damage. Otherwise, it lasts until the hag dismisses it (no action required) or can no longer see it. If the hag uses this lair action to create a new duplicate, the previous one vanishes, dropping any real objects in its possession."
        ]
    },
    "alignment": "CE",
    "size": "Medium",
    "type": "fey"
}