{
    "tags": [],
    "strength": "16",
    "dexterity": "16",
    "constitution": "15",
    "intelligence": "5",
    "wisdom": "10",
    "charisma": "7",
    "name": "Blistercoil Weird",
    "AC": 13,
    "speed": [
        "40 ft",
        "swim 60 ft"
    ],
    "saving_throws": {},
    "skills": {},
    "damage_immunities": [
        "poison"
    ],
    "resistances": [
        "cold, fire",
        "bludgeoning, piercing, and slashing from nonmagical attacks"
    ],
    "condition_immunities": [
        "exhaustion, grappled, paralyzed, petrified, poisoned, prone, restrained, unconscious"
    ],
    "senses": [
        "darkvision 60 ft.",
        "passive Perception 10"
    ],
    "languages": [
        "Draconic"
    ],
    "CR": "4 (1,100 XP)",
    "page": 207,
    "book": "Guildmasters\\xe2\\x80\\x99 Guide to Ravnica",
    "traits": {
        "Feed on Fire": "If the weird takes fire damage from a spell or other magical effect, its size increases by one category. If there isn't enough room for the weird to increase in size, it attains the maximum size possible in the space available. While the weird is Large or bigger, it makes Strength checks and saving throws with advantage. If the weird starts its turn at Gargantuan size, the weird releases energy in an explosion. Each creature within 30 feet of the weird must make a DC 12+1d4 + 10 Dexterity saving throw, taking 28 (8d6) fire damage on a failed save, or half as much damage on a successful one. The explosion ignites flammable objects in the area that aren't being worn or carried. The weird's size then becomes Medium.",
        "Form of Fire and Water": "The weird can move through a space as narrow as 1 inch wide without squeezing. In addition, the weird can enter a hostile creature's space and stop there. The first time the weird enters another creature's space on a turn, that creature takes 5 (1d10) fire damage and catches fire; until someone takes an action to douse the fire, the burning creature takes 5 (1d10) fire damage at the start of each of its turns.",
        "Heated Body": "A creature that touches the weird or hits it with a melee attack while within 5 feet of it takes 5 (1d10) fire damage.",
        "Illumination": "The weird sheds bright light in a 30-foot radius and dim light for an additional 30 feet."
    },
    "actions": {
        "Slam": "Melee Weapon Attack: +5+1d4 + 3 to hit, reach 5 ft., one target. Hit: 7 (1d8 + 3) bludgeoning damage plus 7 (2d6) fire damage, or 11 (2d8 + 3) bludgeoning damage plus 14 (4d6) fire damage if the weird is Large or bigger."
    },
    "legendary_actions": {
        "number": 0,
        "options": {}
    },
    "alignment": "CN",
    "size": "Medium",
    "type": "elemental"
}