{
    "tags": [],
    "strength": "24",
    "dexterity": "11",
    "constitution": "24",
    "intelligence": "8",
    "wisdom": "17",
    "charisma": "16",
    "athletics": "+13",
    "insight": "+9",
    "survival": "+9",
    "name": "Borborygmos",
    "AC": 14,
    "speed": [
        "40 ft"
    ],
    "saving_throws": {
        "strength": "proficient",
        "constitution": "proficient",
        "wisdom": "proficient"
    },
    "skills": {
        "athletics": "proficient",
        "insight": "proficient",
        "survival": "proficient"
    },
    "resistances": [
        "poison, psychic"
    ],
    "condition_immunities": [
        "charmed, frightened"
    ],
    "senses": [
        "tremorsense 60 ft.",
        "passive Perception 13"
    ],
    "languages": [
        "Common",
        "Giant"
    ],
    "CR": "18 (20,000 XP)",
    "page": 238,
    "book": "Guildmasters\\xe2\\x80\\x99 Guide to Ravnica",
    "traits": {
        "Legendary Resistance (3/Day)": "If Borborygmos fails a saving throw, he can choose to succeed instead.",
        "Poor Depth Perception": "Borborygmos has disadvantage on any attack roll against a target more than 30 feet away.",
        "Siege Monster": "Borborygmos deals double damage to objects and structures."
    },
    "actions": {
        "Multiattack": "Borborygmos can use his Frightful Presence. He also makes two attacks: one with his maul and one with his stomp.",
        "Maul": "Melee Weapon Attack: +13+1d12 + 7 to hit, reach 10 ft., one target. Hit: 28 (6d6 + 7) bludgeoning damage. If the target is a creature, it must succeed on a DC 21+1d12 + 15 Strength saving throw or be knocked prone.",
        "Stomp": "Melee Weapon Attack: +13+1d12 + 7 to hit, reach 5 ft., one target. Hit: 18 (2d10 + 7) bludgeoning damage.",
        "Rock": "Ranged Weapon Attack: +13+1d12 + 7 to hit, range 30/120 ft., one target. Hit: 29 (4d10 + 7) bludgeoning damage.",
        "Frightful Presence": "Each creature of Borborygmos's choice that is within 60 feet of him and can see or hear him must succeed on a DC 17+1d12 + 11 Wisdom saving throw or become frightened of him for 1 minute. The frightened creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to Borborygmos's Frightful Presence for the next 24 hours."
    },
    "legendary_actions": {
        "number": 3,
        "options": {
            "Attack": " Borborygmos makes a weapon attack.",
            "Bellow (Costs 2 Actions)": " Borborygmos yells menacingly at one creature he can see within 60 feet of him. That creature must succeed on a DC 17+1d12 + 11 Wisdom saving throw or become frightened of him for 1 minute. If the creature is already frightened, it becomes stunned instead. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to Borborygmos's Bellow for the next 24 hours.",
            "Wide Berth (Costs 3 Actions)": " Borborygmos moves up to half his speed and can move through the space of any creature smaller than Huge. The first time Borborygmos enters a creature's space during this move, the creature must make a DC 21+1d12 + 15 Dexterity saving throw. If the saving throw succeeds, the creature is pushed 5 feet away from Borborygmos. If the saving throw fails, that creature is knocked prone, and Borborygmos can make a stomp attack against it."
        }
    },
    "alignment": "CN",
    "size": "Huge",
    "type": "giant"
}