{
    "tags": [],
    "strength": "10",
    "dexterity": "15",
    "constitution": "12",
    "intelligence": "8",
    "wisdom": "14",
    "charisma": "14",
    "name": "Carrionette",
    "HP": "27 (6d6 + 6)",
    "AC": 15,
    "speed": [
        "25 ft"
    ],
    "saving_throws": {},
    "skills": {},
    "resistances": [
        "poison, psychic"
    ],
    "condition_immunities": [
        "charmed, frightened, poisoned"
    ],
    "senses": [
        "passive Perception 12"
    ],
    "languages": [
        "understands the languages of its creator"
    ],
    "CR": "1 (200 XP)",
    "page": 231,
    "book": "Van Richten\\xe2\\x80\\x99s Guide to Ravenloft",
    "traits": {
        "False Object": "If the carrionette is motionless at the start of combat, it has advantage on its initiative roll. Moreover, if a creature hasn't observed the carrionette move or act, that creature must succeed on a DC 15+1d4 + 13 Wisdom (Perception) check to discern that the carrionette is animate.",
        "Unusual Nature": "The carrionette doesn't require air, food, drink, or sleep."
    },
    "actions": {
        "Silver Needle": "Melee Weapon Attack: +4+1d4 + 2 to hit, reach 5 ft., one creature. Hit: 1 piercing damage plus 3 (1d6) necrotic damage, and the target must succeed on a DC 12+1d4 + 10 Charisma saving throw or become cursed for 1 minute. While cursed in this way, the target's speed is reduced by 10 feet, and it must roll a 1d4 and subtract the number rolled from each ability check or attack roll it makes.",
        "Soul Swap": "The carrionette targets a creature it can see within 15 feet of it that is cursed by its Silver Needle. Unless the target is protected by a protection from evil and good spell, it must succeed on a DC 12+1d4 + 10 Charisma saving throw or have its consciousness swapped with the carrionette. The carrionette gains control of the target's body, and the target is unconscious for 1 hour, after which it gains control of the carrionette's body. While controlling the target's body, the carrionette retains its Intelligence, Wisdom, and Charisma scores. It otherwise uses the controlled body's statistics, but doesn't gain access to the target's knowledge, class features, or proficiencies."
    },
    "alignment": "U",
    "size": "Small",
    "type": "construct"
}