{
    "tags": [],
    "strength": "24",
    "dexterity": "11",
    "constitution": "19",
    "intelligence": "10",
    "wisdom": "10",
    "charisma": "3",
    "name": "Chardalyn Dragon",
    "AC": 17,
    "speed": [
        "30 ft",
        "fly 90 ft"
    ],
    "saving_throws": {
        "strength": "proficient",
        "constitution": "proficient"
    },
    "skills": {},
    "damage_immunities": [
        "cold, poison"
    ],
    "resistances": [
        "radiant",
        "bludgeoning, piercing, and slashing from nonmagical attacks"
    ],
    "condition_immunities": [
        "charmed, exhaustion, frightened, paralyzed, petrified, poisoned"
    ],
    "senses": [
        "darkvision 120 ft.",
        "passive Perception 10"
    ],
    "languages": [
        "the languages known by its creator"
    ],
    "CR": "11 (7,200 XP)",
    "page": 281,
    "book": "Icewind Dale: Rime of the Frostmaiden",
    "traits": {
        "Immutable Form": "The dragon is immune to any spell or effect that would alter its form.",
        "Magic Resistance": "The dragon has advantage on saving throws against spells and other magical effects.",
        "Siege Monster": "The dragon deals double damage to objects and structures.",
        "Unusual Nature": "The dragon doesn't require air, food, drink, or sleep, and it gains no benefit from finishing a short or long rest."
    },
    "actions": {
        "Multiattack": "The dragon uses its Malevolent Presence. It then makes three attacks: two with its claws and one with its tail. If the dragon isn't flying, it can also make one attack with its wings.",
        "Claw": "Melee Weapon Attack: +11+1d8 + 7 to hit, reach 5 ft., one target. Hit: 14 (2d6 + 7) slashing damage.",
        "Tail": "Melee Weapon Attack: +11+1d8 + 7 to hit, reach 10 ft., one target. Hit: 18 (2d10 + 7) bludgeoning damage.",
        "Wings": "Melee Weapon Attack: +11+1d8 + 7 to hit, reach 10 ft., one target. Hit: 12 (2d4 + 7) bludgeoning damage.",
        "Malevolent Presence": "Any creature with an Intelligence of 4 or more that is within 30 feet of the dragon must succeed on a DC 16+1d8 + 12 Wisdom saving throw or be charmed by it for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Malevolent Presence for the next 24 hours. A creature charmed in this way fixates on another creature or object that the dragon mentally chooses and must, on each of its turns, move as close as it can to that target and use its action to make a melee attack against it. If the dragon doesn't choose a target, the charmed creature can act normally on its turn.",
        "Radiant Breath (Recharge 5xe2x80x936)": "The dragon exhales a ray of radiant energy in a 120-foot line that is 5 feet wide. Each creature in that line must make a DC 16+1d8 + 12 Dexterity saving throw, taking 31 (7d8) radiant damage on a failed save, or half as much damage on a successful one."
    },
    "legendary_actions": {
        "number": 0,
        "options": {}
    },
    "alignment": "CE",
    "size": "Huge",
    "type": "construct"
}