{
    "tags": [],
    "hit": "16d12",
    "strength": "27",
    "dexterity": "11",
    "constitution": "10",
    "intelligence": "12",
    "wisdom": "16",
    "charisma": "17",
    "perception": "+7",
    "name": "Cloud Giant Ghost",
    "AC": 15,
    "speed": [
        "0 ft",
        "fly 40 ft. (hover)"
    ],
    "saving_throws": {
        "wisdom": "proficient",
        "charisma": "proficient"
    },
    "skills": {
        "perception": "proficient"
    },
    "damage_immunities": [
        "necrotic, poison"
    ],
    "resistances": [
        "cold"
    ],
    "condition_immunities": [
        "charmed, exhaustion, frightened, grappled, paralyzed, petrified, poisoned, prone, restrained"
    ],
    "senses": [
        "darkvision 120 ft.",
        "passive Perception 17"
    ],
    "languages": [
        "Common",
        "Giant"
    ],
    "CR": "9 (5,000 XP)",
    "page": 146,
    "book": "Candlekeep Mysteries",
    "traits": {
        "Ethereal Sight": "The ghost can see 120 feet into the Ethereal Plane when it is on the Material Plane, and vice versa.",
        "Incorporeal Movement": "The ghost can move through other creatures and objects as if they were difficult terrain. It takes 5 (1d10) force damage if it ends its turn inside an object.",
        "Regeneration": "The ghost regains 10 hit points at the start of its turn. If the ghost takes radiant damage or damage from a magic weapon, this trait doesn't function at the start of the ghost's next turn. The ghost dies only if it starts its turn with 0 hit points and doesn't regenerate."
    },
    "actions": {
        "Multiattack": "The ghost makes two melee attacks.",
        "Spectral Weapon": "Melee Weapon Attack: +12+1d8 + 8 to hit, reach 10 ft., one target. Hit: 21 (3d8 + 8) force damage.",
        "Etherealness": "The ghost enters the Ethereal Plane from the Material Plane, or vice versa. It is visible on the Material Plane while it is in the Border Ethereal, and vice versa, yet it can't affect or be affected by anything on the other plane.",
        "Spellcasting": "The ghost casts one of the following spells, using Charisma as the spellcasting ability and requiring no material components:",
        "Wind Howl (Recharge 6)": "The ghost emits a dreadful howl that summons a cold, biting wind. This wind engulfs up to three creatures of the ghost's choice that it can see within 60 feet of it. Each target is pulled up to 20 feet toward the ghost and must make a DC 15+1d8 + 11 Constitution saving throw, taking 16 (3d10) cold damage on a failed save, or half as much damage on a successful one."
    },
    "legendary_actions": {
        "number": 0,
        "options": {}
    },
    "alignment": "U",
    "size": "Huge",
    "type": "undead"
}