{
    "tags": [],
    "strength": "12",
    "dexterity": "19",
    "constitution": "14",
    "intelligence": "19",
    "wisdom": "20",
    "charisma": "21",
    "arcana": "+8",
    "nature": "+8",
    "perception": "+9",
    "name": "Conclave Dryad",
    "HP": "143 (22d8 + 44)",
    "AC": 16,
    "speed": [
        "30 ft"
    ],
    "saving_throws": {
        "intelligence": "proficient",
        "wisdom": "proficient",
        "charisma": "proficient"
    },
    "skills": {
        "arcana": "proficient",
        "nature": "proficient",
        "perception": "proficient"
    },
    "senses": [
        "darkvision 60 ft.",
        "passive Perception 19"
    ],
    "languages": [
        "Common",
        "Elvish",
        "Sylvan"
    ],
    "CR": "9 (5,000 XP)",
    "page": 194,
    "book": "Guildmasters\\xe2\\x80\\x99 Guide to Ravnica",
    "traits": {
        "spellcasting": {
            "ability": "charisma",
            "type": "innate",
            "spells": {
                "At": [
                    "druidcraft"
                ],
                "3/day": [
                    "dispel magic",
                    "entangle",
                    "plant growth",
                    "spike growth"
                ],
                "1/day": [
                    "moonbeam",
                    "grasping vine",
                    "wall of thorns"
                ]
            }
        },
        "Magic Resistance": "The dryad has advantage on saving throws against spells and other magical effects.",
        "Speak with Beasts and Plants": "The dryad can communicate with beasts and plants as if they and the dryad shared a language."
    },
    "actions": {
        "Multiattack": "The dryad makes three attacks, using its vine staff, its longbow, or both.",
        "Vine Staff": "Melee Weapon Attack: +9+1d8 + 5 to hit, reach 5 ft., one target. Hit: 12 (2d6 + 5) bludgeoning damage. If the target is a creature, it must succeed on a DC 17+1d8 + 13 Dexterity saving throw or become restrained by twisting vines for 1 minute. A target restrained in this way can use an action to make a DC 17+1d8 + 13 Strength (Athletics) or Dexterity (Acrobatics) check, ending the effect on itself on a success.",
        "Longbow": "Ranged Weapon Attack: +8+1d8 + 4 to hit, range 150/600 ft., one target. Hit: 8 (1d8 + 4) piercing damage.",
        "Summon Mount (1/Day)": "The dryad magically summons a mount, which appears in an unoccupied space within 60 feet of the dryad. The mount remains for 8 hours, until it or the dryad dies, or until the dryad dismisses it as an action. The mount uses the stat block of an elk (see the Monster Manual) with these changes: it is a plant instead of a beast, it has an Intelligence of 6, and it understands Sylvan but can't speak. While within 1 mile of the mount, the dryad can communicate with it telepathically.",
        "Suppress Magic (Recharge 5xe2x80x936)": "The dryad targets one magic item it can see within 120 feet of it. If the magic item isn't an artifact, its magical properties are suppressed for 10 minutes, until the dryad is incapacitated or dies, or until the dryad uses a bonus action to end the effect."
    },
    "alignment": "LG",
    "size": "Medium",
    "type": "fey"
}