{
    "tags": [
        "elf"
    ],
    "strength": "12",
    "dexterity": "18",
    "constitution": "16",
    "intelligence": "17",
    "wisdom": "21",
    "charisma": "22",
    "insight": "+11",
    "perception": "+11",
    "religion": "+9",
    "stealth": "+10",
    "name": "Drow Matron Mother",
    "AC": 17,
    "speed": [
        "30 ft"
    ],
    "saving_throws": {
        "constitution": "proficient",
        "wisdom": "proficient",
        "charisma": "proficient"
    },
    "skills": {
        "insight": "proficient",
        "perception": "proficient",
        "religion": "proficient",
        "stealth": "proficient"
    },
    "condition_immunities": [
        "charmed, frightened, poisoned"
    ],
    "senses": [
        "darkvision 120 ft.",
        "passive Perception 21"
    ],
    "languages": [
        "Elvish",
        "Undercommon"
    ],
    "CR": "20 (25,000 XP)",
    "page": 186,
    "book": "Mordenkainen\\xe2\\x80\\x99s Tome of Foes",
    "traits": {
        "Fey Ancestry": "The drow has advantage on saving throws against being charmed, and magic can't put the drow to sleep.",
        "spellcasting": {
            "level": 20,
            "type": "cleric",
            "spells": [
                "guidance",
                "mending",
                "resistance",
                "sacred flame",
                "thaumaturgy",
                "bane",
                "command",
                "cure wounds",
                "guiding bolt",
                "hold person",
                "silence",
                "spiritual weapon",
                "bestow curse",
                "clairvoyance",
                "dispel magic",
                "spirit guardians",
                "banishment",
                "death ward",
                "freedom of movement",
                "guardian of faith",
                "contagion",
                "flame strike",
                "geas",
                "mass cure wounds",
                "blade barrier",
                "harm",
                "divine word",
                "plane shift",
                "holy aura",
                "gate"
            ]
        },
        "Lolth's Fickle Favor": "As a bonus action, the matron can bestow the Spider Queen's blessing on one ally she can see within 30 feet of her. The ally takes 7 (2d6) psychic damage but has advantage on the next attack roll it makes until the end of its next turn.",
        "Magic Resistance": "The drow has advantage on saving throws against spells and other magical effects.",
        "Sunlight Sensitivity": "While in sunlight, the drow has disadvantage on attack rolls, as well as on Wisdom (Perception) checks that rely on sight."
    },
    "actions": {
        "Multiattack": "The matron mother makes two demon staff attacks or three tentacle rod attacks.",
        "Demon Staff": "Melee Weapon Attack: +10+1d12 + 4 to hit, reach 5 ft., one target. Hit: 7 (1d6 + 4) bludgeoning damage, or 8 (1d8 + 4) bludgeoning damage if used with two hands, plus 14 (4d6) psychic damage. In addition, the target must succeed on a DC19 Wisdom saving throw or become frightened of the drow for 1 minute. The frightened target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.",
        "Tentacle Rod": "Melee Weapon Attack: +9+1d12 + 3 to hit, reach 15 ft., one target. Hit: 3 (1d6) bludgeoning damage. If the target is hit three times by the rod on one turn, the target must succeed on a DC 15+1d12 + 9 Constitution saving throw or suffer the following effects for 1 minute: the target's speed is halved, it has disadvantage on Dexterity saving throws, and it can't use reactions. Moreover, on each of its turns, it can take either an action or a bonus action, but not both. At the end of each of its turns, it can repeat the saving throw, ending the effect on itself on a success.",
        "Summon Servant (1/Day)": "The drow magically summons a retriever or a yochlol. The summoned creature appears in an unoccupied space within 60 feet of its summoner, acts as an ally of its summoner, and can't summon other demons. It remains for 10 minutes, until it or its summoner dies, or until its summoner dismisses it as an action."
    },
    "legendary_actions": {
        "number": 3,
        "options": {
            "Demon Staff": " The drow makes one attack with her demon staff.",
            "Compel Demon (Costs 2 Actions)": " An allied demon within 30 feet of the drow uses its reaction to make one attack against a target of the drow's choice that she can see.",
            "Cast a Spell (Costs 1xe2x80x933 Actions)": " The drow expends a spell slot to cast a 1st-, 2nd-, or 3rd-level spell that she has prepared. Doing so costs 1 legendary action per level of the spell."
        }
    },
    "alignment": "NE",
    "size": "Medium",
    "type": "humanoid"
}