{
    "tags": [
        "elf"
    ],
    "strength": "14",
    "dexterity": "21",
    "constitution": "16",
    "intelligence": "12",
    "wisdom": "14",
    "charisma": "13",
    "perception": "+6",
    "stealth": "+9",
    "name": "Drow Shadowblade",
    "AC": 17,
    "speed": [
        "30 ft"
    ],
    "saving_throws": {
        "dexterity": "proficient",
        "constitution": "proficient",
        "wisdom": "proficient"
    },
    "skills": {
        "perception": "proficient",
        "stealth": "proficient"
    },
    "senses": [
        "darkvision 120 ft.",
        "passive Perception 16"
    ],
    "languages": [
        "Elvish",
        "Undercommon"
    ],
    "CR": "11 (7,200 XP)",
    "page": 187,
    "book": "Mordenkainen\\xe2\\x80\\x99s Tome of Foes",
    "traits": {
        "Fey Ancestry": "The drow has advantage on saving throws against being charmed, and magic can't put the drow to sleep.",
        "spellcasting": {
            "type": "innate",
            "spells": [
                "dancing lights",
                "darkness",
                "faerie fire",
                "levitate"
            ]
        },
        "Shadow Step": "While in dim light or darkness, the drow can teleport as a bonus action up to 60 feet to an unoccupied space it can see that is also in dim light or darkness. It then has advantage on the first melee attack it makes before the end of the turn.",
        "Sunlight Sensitivity": "While in sunlight, the drow has disadvantage on attack rolls, as well as on Wisdom (Perception) checks that rely on sight."
    },
    "actions": {
        "Multiattack": "The drow makes two attacks with its shadow sword. If either attack hits and the target is within 10 feet of a 5-foot cube of darkness created by the shadow sword on a previous turn, the drow can dismiss that darkness and cause the target to take 21 (6d6) necrotic damage. The drow can dismiss darkness in this way no more than once per turn.",
        "Shadow Sword": "Melee Weapon Attack: +9+1d8 + 5 to hit, reach 5 ft., one target. Hit: 8 (1d6 + 5) piercing damage plus 10 (3d6) necrotic damage and 10 (3d6) poison damage. The drow can then fill an unoccupied 5-foot cube within 5 feet of the target with magical darkness, which remains for 1 minute.",
        "Hand Crossbow": "Ranged Weapon Attack: +9+1d8 + 5 to hit, range 30/120 ft., one target. Hit: 8 (1d6 + 5) piercing damage, and the target must succeed on a DC 13+1d8 + 9 Constitution saving throw or be poisoned for 1 hour. If the saving throw fails by 5 or more, the target is also unconscious while poisoned in this way. The target regains consciousness if it takes damage or if another creature takes an action to shake it."
    },
    "legendary_actions": {
        "number": 0,
        "options": {}
    },
    "alignment": "NE",
    "size": "Medium",
    "type": "humanoid"
}