{
    "tags": [],
    "strength": "26",
    "dexterity": "21",
    "constitution": "22",
    "intelligence": "26",
    "wisdom": "23",
    "charisma": "24",
    "arcana": "+15",
    "history": "+15",
    "insight": "+13",
    "perception": "+13",
    "name": "Dyrrn",
    "HP": "325 (31d8 + 186)",
    "AC": 21,
    "speed": [
        "40 ft",
        "fly 40 ft. (hover)"
    ],
    "saving_throws": {
        "intelligence": "proficient",
        "wisdom": "proficient",
        "charisma": "proficient"
    },
    "skills": {
        "arcana": "proficient",
        "history": "proficient",
        "insight": "proficient",
        "perception": "proficient"
    },
    "resistances": [
        "poison, psychic"
    ],
    "condition_immunities": [
        "blinded, charmed, exhaustion, frightened, poisoned, prone"
    ],
    "senses": [
        "truesight 120 ft.",
        "passive Perception 23"
    ],
    "languages": [
        "Deep Speech",
        "telepathy 120 ft."
    ],
    "CR": "24 (62,000 XP)",
    "page": 288,
    "book": "Eberron: Rising from the Last War",
    "traits": {
        "Alien Mind": "If a creature tries to read Dyrrn's thoughts or deals psychic damage to it, that creature must succeed on a DC 23+1d14 + 16 Intelligence saving throw or be stunned for 1 minute. The stunned creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.",
        "Legendary Resistance (3/Day)": "If Dyrrn fails a saving throw, it can choose to succeed instead.",
        "Magic Resistance": "Dyrrn has advantage on saving throws against spells and other magical effects.",
        "Regeneration": "Dyrrn regains 20 hit points at the start of its turn. If Dyrrn takes radiant damage, this trait doesn't function at the start of its next turn. Dyrrn dies only if it starts its turn with 0 hit points and doesn't regenerate.",
        "Teleport": "As a bonus action, Dyrrn can teleport up to 30 feet to an unoccupied space it can see."
    },
    "actions": {
        "Multiattack": "Dyrrn makes one Tentacle Whip attack and uses its Corruption once. Dyrrn can replace its Tentacle Whip attack with Extract Brain if it has a creature grappled.",
        "Tentacle Whip": "Melee Weapon Attack: +15+1d14 + 8 to hit, reach 10 ft., one target. Hit: 24 (3d10 + 8) slashing damage. If the target is a Medium or smaller creature, it is grappled (escape DC 23+1d14 + 16), pulled into an unoccupied space within 5 feet of Dyrrn, and must succeed on a DC 23+1d14 + 16 Intelligence saving throw or be stunned until this grapple ends. Dyrrn can't use the same tentacle whip on another target until this grapple ends. Dyrrn has two tentacle whips.",
        "Corruption": "Dyrrn targets one creature it can see within 60 feet of it. The target must succeed on a DC 23+1d14 + 16 Constitution saving throw or take 22 (4d6 + 8) necrotic damage and become corrupted for 1 minute.",
        "Extract Brain": "Melee Weapon Attack: +15+1d14 + 8 to hit, reach 5 ft., one incapacitated creature grappled by Dyrrn. Hit: 55 (10d10) piercing damage. If this damage reduces the target to 0 hit points, Dyrrn kills the target by extracting and devouring its brain."
    },
    "legendary_actions": {
        "number": 3,
        "options": {
            "Tentacle Whip": " Dyrrn makes one attack with its ",
            "Spawn Aberration (Costs 2 Actions)": " Dyrrn regurgitates an intellect devourer in an unoccupied space within 5 feet of it. The intellect devourer is under Dyrrn's control and acts immediately after Dyrrn in the initiative order.",
            "Mind Blast (Costs 3 Actions)": " Dyrrn magically emits psychic energy in a 60-foot cone. Each creature in that area must succeed on a DC 23+1d14 + 16 Intelligence saving throw or take 30 (5d8 + 8) psychic damage and be stunned for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
        }
    },
    "in_lair": {
        "CR_increase": 1,
        "actions": [
            "Dyrrn uses its Corruption action.",
            "A 30-foot-square area of ground within 120 feet of Dyrrn sprouts tentacles until initiative count 20 on the next round. Any creature that starts or ends its turn in the area must succeed on a DC 23+1d14 + 16 Strength saving throw or be restrained. A creature can escape the tentacles with a successful DC 23+1d14 + 16 Strength (Athletics) or Dexterity (Acrobatics) check as an action.",
            "Each creature of Dyrrn's choice that it can see within 120 feet of it must succeed on a DC 23+1d14 + 16 Wisdom saving throw or take 26 (4d12) psychic damage. Unless the target has immunity to psychic damage, its Intelligence score is reduced by 1d4 each time it fails the saving throw for this lair action. The target dies if its Intelligence score is reduced to 0. The reduction lasts until the target finishes a short or long rest."
        ]
    },
    "alignment": "CE",
    "size": "Medium",
    "type": "aberration"
}