{
    "tags": [],
    "strength": "15",
    "dexterity": "10",
    "constitution": "20",
    "intelligence": "21",
    "wisdom": "19",
    "charisma": "24",
    "arcana": "+10",
    "deception": "+12",
    "insight": "+14",
    "intimidation": "+12",
    "persuasion": "+12",
    "name": "Elder Brain",
    "AC": 10,
    "speed": [
        "5 ft",
        "swim 10 ft"
    ],
    "saving_throws": {
        "intelligence": "proficient",
        "wisdom": "proficient",
        "charisma": "proficient"
    },
    "skills": {
        "arcana": "proficient",
        "deception": "proficient",
        "insight": "expert",
        "intimidation": "proficient",
        "persuasion": "proficient"
    },
    "senses": [
        "blindsight 120 ft.",
        "passive Perception 14"
    ],
    "languages": [
        "understands Common",
        "Deep Speech",
        "and Undercommon but can't speak",
        "telepathy 5 miles"
    ],
    "CR": "14 (11,500 XP)",
    "page": 173,
    "book": "Volo\\xe2\\x80\\x99s Guide to Monsters",
    "traits": {
        "Creature Sense": "The elder brain is aware of the presence of creatures within 5 miles of it that have an Intelligence score of 4 or higher. It knows the distance and direction to each creature, as well as each one's intelligence score, but can't sense anything else about it. A creature protected by a mind blank spell, a nondetection spell, or similar magic can't be perceived in this manner.",
        "spellcasting": {
            "type": "innate",
            "spells": [
                "detect thoughts",
                "levitate",
                "dominate monster",
                "plane shift"
            ]
        },
        "Legendary Resistance (3/Day)": "If the elder brain fails a saving throw, it can choose to succeed instead.",
        "Magic Resistance": "The elder brain has advantage on saving throws against spells and other magical effects.",
        "Telepathic Hub": "The elder brain can use its telepathy to initiate and maintain telepathic conversations with up to ten creatures at a time. The elder brain can let those creatures telepathically hear each other while connected in this way."
    },
    "actions": {},
    "legendary_actions": {
        "number": 3,
        "options": {
            "Tentacle": "The elder brain makes a tentacle attack.",
            "Break Concentration": "The elder brain targets a creature within 120 feet of it with which it has a psychic link. The elder brain breaks the creature's concentration on a spell it has cast. The creature also takes 1d4 psychic damage per level of the spell.",
            "Psychic Pulse": "The elder brain targets a creature within 120 feet of it with which it has a psychic link. Enemies of the elder brain within 10 feet of that creature take 10 (3d6) psychic damage.",
            "Sever Psychic Link": "The elder brain targets a creature within 120 feet of it with which it has a psychic link. The elder brain ends the link, causing the creature to have disadvantage on all ability checks, attack rolls, and saving throws until the end of the creature's next turn."
        }
    },
    "in_lair": {
        "CR_increase": 1,
        "actions": [
            "The elder brain casts wall of force.",
            "The elder brain targets one friendly creature it can sense within 120 feet of it. The target has a flash of inspiration and gains advantage on one attack roll, ability check, or saving throw it makes before the end of its next turn. If the target doesn't or can't use this benefit in that time, the inspiration is lost.",
            "The elder brain targets one creature it can sense within 120 feet of it and anchors it by sheer force of will. The target must succeed on a DC 18+1d10 + 13 Charisma saving throw or be unable to leave its current space. It can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
        ]
    },
    "alignment": "LE",
    "size": "Large",
    "type": "aberration"
}