{
    "tags": [],
    "strength": "19",
    "dexterity": "16",
    "constitution": "17",
    "intelligence": "10",
    "wisdom": "17",
    "charisma": "14",
    "insight": "+6",
    "perception": "+6",
    "name": "Felidar",
    "AC": 17,
    "speed": [
        "40 ft"
    ],
    "saving_throws": {
        "dexterity": "proficient",
        "wisdom": "proficient",
        "charisma": "proficient"
    },
    "skills": {
        "insight": "proficient",
        "perception": "proficient"
    },
    "senses": [
        "truesight 120 ft.",
        "passive Perception 16"
    ],
    "languages": [
        "understands Celestial and Common but can't speak"
    ],
    "CR": "5 (1,800 XP)",
    "page": 199,
    "book": "Guildmasters\\xe2\\x80\\x99 Guide to Ravnica",
    "traits": {
        "Bonding": "The felidar can magically bond with one creature it can see, right after spending at least 1 hour observing that creature while within 30 feet of it. The bond lasts until the felidar bonds with a different creature or until the bonded creature dies. This bond has the following effects: The felidar and the bonded creature can communicate telepathically with each other at a distance of up to 100 feet. The felidar can sense the direction and distance to the bonded creature if they're on the same plane of existence. As an action, the felidar or the bonded creature can sense what the other sees and hears, during which time it loses its own sight and hearing. This effect lasts until the start of its next turn.",
        "Keen Hearing and Sight": "The felidar has advantage on Wisdom (Perception) checks that rely on hearing or sight.",
        "Pounce": "If the felidar moves at least 20 feet straight toward a creature and hits it with a claw attack on the same turn, that target must succeed on a DC 15+1d6 + 12 Strength saving throw or be knocked prone. If the target is prone, the felidar can make one claw attack against it as a bonus action."
    },
    "alignment": "LN",
    "size": "Large",
    "type": "celestial"
}