{
    "tags": [],
    "strength": "17",
    "dexterity": "5",
    "constitution": "20",
    "intelligence": "3",
    "wisdom": "10",
    "charisma": "5",
    "name": "Flail Snail",
    "HP": "52 (5d10 + 25)",
    "AC": 16,
    "speed": [
        "10 ft"
    ],
    "saving_throws": {},
    "skills": {},
    "damage_immunities": [
        "fire, poison"
    ],
    "condition_immunities": [
        "poisoned"
    ],
    "senses": [
        "darkvision 60 ft.",
        "tremorsense 60 ft.",
        "passive Perception 10"
    ],
    "languages": [
        "\\xe2\\x80\\x94"
    ],
    "CR": "3 (700 XP)",
    "page": 144,
    "book": "Volo\\xe2\\x80\\x99s Guide to Monsters",
    "traits": {
        "Antimagic Shell": "The snail has advantage on saving throws against spells, and any creature making a spell attack against the snail has disadvantage on the attack roll. If the snail succeeds on its saving throw against a spell or a spell attack misses it, an additional effect might occur, as determined by rolling a d6:",
        "Flail Tentacles": "The flail snail has five flail tentacles. Whenever the snail takes 10 damage or more on a single turn, one of its tentacles dies. If even one tentacle remains, the snail regrows all dead ones within 1d4 days. If all its tentacles die, the snail retracts into its shell, gaining total cover, and it begins wailing, a sound that can be heard for 600 feet, stopping only when it dies 5d6 minutes later. Healing magic that restores limbs, such as the regenerate spell, can halt this dying process."
    },
    "actions": {
        "Multiattack": "The flail snail makes as many flail tentacle attacks as it has flail tentacles, all against the same target.",
        "Flail Tentacle": "Melee Weapon Attack: +5+1d4 + 3 to hit, reach 10 ft., one target. Hit: 6 (1d6 + 3) bludgeoning damage.",
        "Scintillating Shell (Recharges after a Short or Long Rest)": "The snail's shell emits dazzling, colored light until the end of the snail's next turn. During this time, the shell sheds bright light in a 30-foot radius and dim light for an additional 30 feet, and creatures that can see the snail have disadvantage on attack rolls against it. In addition, any creature within the bright light and able to see the snail when this power is activated must succeed on a DC 15+1d4 + 13 Wisdom saving throw or be stunned until the light ends.",
        "Shell Defense": "The flail snail withdraws into its shell, gaining a +4 bonus to AC until it emerges. It can emerge from its shell as a bonus action on its turn."
    },
    "alignment": "U",
    "size": "Large",
    "type": "elemental"
}