{
    "tags": [],
    "strength": "8",
    "dexterity": "14",
    "constitution": "10",
    "intelligence": "10",
    "wisdom": "12",
    "charisma": "18",
    "perception": "+7",
    "name": "Gallows Speaker",
    "hit_dice_type": "d8",
    "num_hit_dice": 19,
    "HP": "85 (19d8)",
    "AC": 12,
    "speed": [
        "0 ft",
        "fly 40 ft. (hover)"
    ],
    "saving_throws": {
        "wisdom": "proficient"
    },
    "skills": {
        "perception": "expert"
    },
    "damage_immunities": [
        "necrotic, poison"
    ],
    "resistances": [
        "bludgeoning, piercing, and slashing from nonmagical attacks"
    ],
    "condition_immunities": [
        "charmed, exhaustion, frightened, grappled, paralyzed, petrified, poisoned, prone, restrained"
    ],
    "senses": [
        "truesight 60 ft.",
        "passive Perception 17"
    ],
    "languages": [
        "any languages its component spirits knew in life"
    ],
    "CR": "6 (2,300 XP)",
    "page": 234,
    "book": "Van Richten\\xe2\\x80\\x99s Guide to Ravenloft",
    "traits": {
        "Divination Senses": "The gallows speaker can see 60 feet into the Ethereal Plane when it is on the Material Plane and vice versa.",
        "Incorporeal Movement": "The gallows speaker can move through other creatures and objects as if they were difficult terrain. It takes 5 (1d10) force damage if it ends it turn inside an object.",
        "Unusual Nature": "The gallows speaker doesn't require air, food, drink, or sleep."
    },
    "actions": {
        "Foretelling Touch": "Melee Spell Attack: +7+1d6 + 4 to hit, reach 5 ft., one creature. Hit: 15 (2d10 + 4) psychic damage, and the target must roll a d4 and subtract the number rolled from the next attack roll or saving throw it makes before the start of the gallows speaker's next turn.",
        "Suffering Echoes": "The gallows speaker targets a creature it can see within 30 feet of it. The target must make a DC 15+1d6 + 12 Wisdom saving throw. On a failed save, the target takes 19 (3d12) psychic damage, and waves of painful memories leap from the target to up to three other creatures of the gallows speaker's choice that are within 30 feet of the target, each of which takes 13 (3d8) psychic damage."
    },
    "alignment": "U",
    "size": "Medium",
    "type": "undead"
}