{
    "tags": [],
    "strength": "21",
    "dexterity": "17",
    "constitution": "19",
    "intelligence": "14",
    "wisdom": "16",
    "charisma": "18",
    "deception": "+10",
    "insight": "+9",
    "perception": "+9",
    "stealth": "+9",
    "name": "Hythonia",
    "AC": 17,
    "speed": [
        "40 ft",
        "climb 40 ft",
        "swim 40 ft"
    ],
    "saving_throws": {
        "strength": "proficient",
        "constitution": "proficient",
        "charisma": "proficient"
    },
    "skills": {
        "deception": "proficient",
        "insight": "proficient",
        "perception": "proficient",
        "stealth": "proficient"
    },
    "damage_immunities": [
        "poison"
    ],
    "condition_immunities": [
        "charmed, frightened, poisoned"
    ],
    "senses": [
        "darkvision 120 ft.",
        "passive Perception 19"
    ],
    "languages": [
        "Common"
    ],
    "CR": "17 (18,000 XP, or 36,000 XP as a mythic encounter)",
    "page": 252,
    "book": "Mythic Odysseys of Theros",
    "traits": {
        "spellcasting": {
            "type": "innate",
            "spells": [
                "animate objects",
                "animate objects"
            ]
        },
        "Legendary Resistance (3/Day)": "If Hythonia fails a saving throw, she can choose to succeed instead.",
        "Petrifying Gaze": "When a creature that can see Hythonia's eyes starts its turn within 30 feet of her, Hythonia can force it to make a DC 18+1d12 + 12 Constitution saving throw if she isn't incapacitated and can see the creature. If the saving throw fails by 5 or more, the creature is instantly petrified. Otherwise, on a failed save the creature begins to turn to stone and is restrained. The restrained creature must repeat the saving throw at the end of its next turn, becoming petrified on a failure or ending the effect on a success. The petrification lasts until the creature is freed by the greater restoration spell or other magic. Unless surprised, a creature can avert its eyes to avoid the saving throw at the start of its turn. If the creature does so, it can't see Hythonia until the start of its next turn, when it can avert its eyes again. If the creature looks at Hythonia in the meantime, it must immediately make the save. If Hythonia sees herself reflected on a polished surface within 30 feet of her and in an area of bright light, she is affected by her own gaze.",
        "Shed Skin (Mythic Trait; Recharges after a Short or Long Rest)": "If Hythonia is reduced to 0 hit points, she doesn't die or fall unconscious. Instead, she sheds her skin, regains 199 hit points, and moves up to her speed without provoking opportunity attacks."
    },
    "alignment": "LE",
    "size": "Large",
    "type": "monstrosity"
}