{
    "tags": [],
    "strength": "11",
    "dexterity": "16",
    "constitution": "16",
    "intelligence": "20",
    "wisdom": "14",
    "charisma": "16",
    "arcana": "+19",
    "history": "+12",
    "insight": "+9",
    "perception": "+9",
    "name": "Illithilich",
    "HP": "135 (18d8 + 54)",
    "AC": 17,
    "speed": [
        "30 ft"
    ],
    "saving_throws": {
        "constitution": "proficient",
        "intelligence": "proficient",
        "wisdom": "proficient"
    },
    "skills": {
        "arcana": "expert",
        "history": "proficient",
        "insight": "proficient",
        "perception": "proficient"
    },
    "damage_immunities": [
        "poison",
        "bludgeoning, piercing, and slashing from nonmagical attacks"
    ],
    "resistances": [
        "cold, lightning, necrotic"
    ],
    "condition_immunities": [
        "charmed, exhaustion, frightened, paralyzed, poisoned"
    ],
    "senses": [
        "truesight 120 ft.",
        "passive Perception 19"
    ],
    "languages": [
        "Deep Speech",
        "Undercommon",
        "telepathy 120 ft."
    ],
    "CR": "22 (41,000 XP)",
    "page": 172,
    "book": "Volo\\xe2\\x80\\x99s Guide to Monsters",
    "traits": {
        "spellcasting": {
            "ability": "intelligence",
            "type": "innate",
            "spells": {
                "Cantrips": [
                    "mage hand",
                    "prestidigitation",
                    "ray of frost"
                ],
                "1st": [
                    "detect magic",
                    "magic missile",
                    "shield",
                    "thunderwave"
                ],
                "2nd": [
                    "detect thoughts",
                    "invisibility",
                    "Melf\\'s acid arrow",
                    "mirror image"
                ],
                "3rd": [
                    "animate dead",
                    "counterspell",
                    "dispel magic",
                    "fireball"
                ],
                "4th": [
                    "blight",
                    "dimension door"
                ],
                "5th": [
                    "cloudkill",
                    "scrying"
                ],
                "6th": [
                    "disintegrate",
                    "globe of invulnerability"
                ],
                "7th": [
                    "finger of death",
                    "plane shift"
                ],
                "8th": [
                    "dominate monster",
                    "power word stun"
                ],
                "9th": [
                    "power word kill"
                ]
            }
        },
        "Legendary Resistance (3/Day)": "If the illithilich fails a saving throw, it can choose to succeed instead.",
        "Magic Resistance": "The illithilich has advantage on saving throws against spells and other magical effects.",
        "Rejuvenation": "If it has a phylactery, a destroyed illithilich gains a new body in 1d10 days, regaining all its hit points and becoming active again. The new body appears within 5 feet of the phylactery.",
        "Turn Resistance": "The illithilich has advantage on saving throws against any effect that turns undead."
    },
    "actions": {
        "Paralyzing Touch": "Melee Spell Attack: +12+1d14 + 5 to hit, reach 5 ft., one creature. Hit: 10 (3d6) cold damage. The target must succeed on a DC 18+1d14 + 11 Constitution saving throw or be paralyzed for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.",
        "Tentacles": "Melee Weapon Attack: +12+1d14 + 5 to hit, reach 5 ft., one creature. Hit: 21 (3d10 + 5) psychic damage. If the target is Large or smaller, it is grappled (escape DC 15+1d14 + 8) and must succeed on a DC 20+1d14 + 13 Intelligence saving throw or be stunned until this grapple ends.",
        "Extract Brain": "Melee Weapon Attack: +12+1d14 + 5 to hit, reach 5 ft., one incapacitated humanoid grappled by the lich. Hit: 55 (10d10) piercing damage. If this damage reduces the target to 0 hit points, the lich kills the target by extracting and devouring its brain.",
        "Mind Blast (Recharge 5xe2x80x936)": "The illithilich magically emits psychic energy in a 60-foot cone. Each creature in that area must succeed on a DC 18+1d14 + 11 Intelligence saving throw or take 27 (5d8 + 5) psychic damage and be stunned for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
    },
    "legendary_actions": {
        "number": 3,
        "options": {
            "Tentacles": " The illithilich makes one attack with its tentacles.",
            "Extract Brain (Costs 2 Actions)": " The illithilich uses Extract Brain.",
            "Mind Blast (Costs 3 Actions)": " The illithilich recharges its Mind Blast and uses it.",
            "Cast Spell (Costs 1xe2x80x933 Actions)": " The illithilich uses a spell slot to cast a 1st-, 2nd-, or 3rd-level spell that it has prepared. Doing so costs 1 legendary action per level of the spell."
        }
    },
    "in_lair": {
        "CR_increase": 1,
        "actions": [
            "The illithilich rolls a d8 and regains a spell slot of that level or lower. If it has no spent spell slots of that level or lower, nothing happens.",
            "The illithilich targets one creature it can see within 30 feet of it. A crackling cord of negative energy tethers the illithilich to the target. Whenever the illithilich takes damage, the target must make a DC 18+1d14 + 11 Constitution saving throw. On a failed save, the illithilich takes half the damage (rounded down), and the target takes the remaining damage. This tether lasts until initiative count 20 on the next round or until the illithilich or the target is no longer in the illithilich's lair.",
            "The illithilich calls forth the spirits of creatures that died in its lair. These apparitions materialize and attack one creature that the illithilich can see within 60 feet of it. The target must succeed on a DC 18+1d14 + 11 Constitution saving throw, taking 52 (15d6) necrotic damage on a failed save, or half as much damage on a success. The apparitions then disappear."
        ]
    },
    "alignment": "AEA",
    "size": "Medium",
    "type": "undead"
}