{
    "tags": [
        "demon"
    ],
    "strength": "24",
    "dexterity": "10",
    "constitution": "23",
    "intelligence": "20",
    "wisdom": "20",
    "charisma": "16",
    "perception": "+12",
    "name": "Juiblex",
    "AC": 18,
    "speed": [
        "30 ft"
    ],
    "saving_throws": {
        "dexterity": "proficient",
        "constitution": "proficient",
        "wisdom": "proficient"
    },
    "skills": {
        "perception": "proficient"
    },
    "damage_immunities": [
        "poison",
        "bludgeoning, piercing, and slashing from nonmagical attacks"
    ],
    "resistances": [
        "cold, fire, lightning"
    ],
    "condition_immunities": [
        "blinded, charmed, deafened, exhaustion, frightened, grappled, paralyzed, petrified, poisoned, prone, restrained, stunned, unconscious"
    ],
    "senses": [
        "truesight 120 ft.",
        "passive Perception 22"
    ],
    "languages": [
        "all",
        "telepathy 120 ft."
    ],
    "CR": "23 (50,000 XP)",
    "page": 151,
    "book": "Mordenkainen\\xe2\\x80\\x99s Tome of Foes",
    "traits": {
        "Foul": "Any creature, other than an ooze, that starts its turn within 10 feet of Juiblex must succeed on a DC 21+1d14 + 14 Constitution saving throw or be poisoned until the start of the creature's next turn.",
        "spellcasting": {
            "type": "innate",
            "spells": [
                "acid splash",
                "detect magic",
                "blight",
                "contagion",
                "gaseous form"
            ]
        },
        "Legendary Resistance (3/Day)": "If Juiblex fails a saving throw, it can choose to succeed instead.",
        "Magic Resistance": "Juiblex has advantage on saving throws against spells and other magical effects.",
        "Magic Weapons": "Juiblex's weapon attacks are magical.",
        "Regeneration": "Juiblex regains 20 hit points at the start of its turn. If it takes fire or radiant damage, this trait doesn't function at the start of its next turn. Juiblex dies only if it starts its turn with 0 hit points and doesn't regenerate.",
        "Spider Climb": "Juiblex can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check."
    },
    "actions": {},
    "legendary_actions": {
        "number": 3,
        "options": {
            "Acid Splash": "Juiblex casts acid splash.",
            "Attack": "Juiblex makes one acid lash attack.",
            "Corrupting Touch (Costs 2 Actions)": "Melee Weapon Attack: +14+1d14 + 7 to hit, reach 10 ft., one creature. Hit: 21 (4d6 + 7) poison damage, and the target is slimed. Until the slime is scraped off with an action, the target is poisoned, and any creature, other than an ooze, is poisoned while within 10 feet of the target."
        }
    },
    "in_lair": {
        "CR_increase": 1,
        "actions": [
            "Juiblex slimes a square area of ground it can see within the lair. The area can be up to 10 feet on a side. The slime lasts for 1 hour or until it is burned away with fire. When the slime appears, each creature in that area must succeed on a DC 21+1d14 + 14 Strength saving throw or become restrained. When a creature enters the area for the first time on a turn or ends its turn there, that creature must make the same save. A restrained creature is stuck as long as it remains in the slimy area or until it breaks free. The restrained creature, or another creature who can reach it, can use its action to try to break free and must succeed on a DC 21+1d14 + 14 Strength check. If the slime is set on fire, it burns away after 1 round. Any creature that starts its turn in the burning slime takes 22 (4d10) fire damage.",
            "Juiblex slimes a square area of ground it can see within the lair. The area can be up to 10 feet on a side. The slime lasts for 1 hour or until it is burned away with fire. When the slime appears, each creature on it must succeed on a DC 21+1d14 + 14 Dexterity saving throw or fall prone and slide 10 feet in a random direction determined by a d8 roll. When a creature enters the area for the first time on a turn or ends its turn there, that creature must make the same save. If the slime is set on fire, it burns away after 1 round. Any creature that starts its turn in the burning slime takes 22 (4d10) fire damage.",
            "A green slime (see the Dungeon Master's Guide) appears on a spot on the ceiling that Juiblex chooses within the lair. The slime disintegrates after 1 hour."
        ]
    },
    "alignment": "CE",
    "size": "Huge",
    "type": "fiend"
}