{
    "tags": [],
    "strength": "18",
    "dexterity": "14",
    "constitution": "18",
    "intelligence": "13",
    "wisdom": "16",
    "charisma": "18",
    "name": "Knight of the Order",
    "HP": "136 (16d8 + 64)",
    "AC": "",
    "speed": [
        "30 ft"
    ],
    "saving_throws": {
        "strength": "proficient",
        "constitution": "proficient",
        "wisdom": "proficient",
        "charisma": "proficient"
    },
    "skills": {},
    "damage_immunities": [
        "poison"
    ],
    "resistances": [
        "necrotic, psychic"
    ],
    "condition_immunities": [
        "charmed, exhaustion, frightened, paralyzed, poisoned, stunned"
    ],
    "senses": [
        "darkvision 60 ft.",
        "passive Perception 13"
    ],
    "languages": [
        "the languages it knew in life"
    ],
    "CR": "5 (1,800 XP)",
    "page": 139,
    "book": "Curse of Strahd",
    "traits": {
        "Regeneration": "The knight regains 10 hit points at the start of its turn. If the knight takes fire or radiant damage, this trait doesn't function at the start of the knight's next turn. The knight's body is destroyed only if it starts its turn with 0 hit points and doesn't regenerate.",
        "Rejuvenation": "When the knight's body is destroyed, its soul lingers. After 24 hours, the soul inhabits and animates another humanoid corpse on the same plane of existence and regains all its hit points. While the soul is bodiless, a wish spell can be used to force the soul to go to the afterlife and not return.",
        "Turn Immunity": "The knight is immune to effects that turn undead.",
        "Vengeful Tracker": "The knight knows the distance to and direction of any creature against which it seeks revenge, even if the creature and the knight are on different planes of existence. If the creature being tracked by the knight dies, the knight knows."
    },
    "actions": {
        "Multiattack": "The knight makes two longsword attacks or two fist attacks.",
        "Longsword": "Melee Weapon Attack: +7+1d6 + 4 to hit, reach 5 ft., one target. Hit: 15 (2d10 + 4) slashing damage. If the target is a creature against which the knight has sworn vengeance, the target takes an extra 14 (4d6) slashing damage.",
        "Fist": "Melee Weapon Attack: +7+1d6 + 4 to hit, reach 5 ft., one target. Hit: 11 (2d6 + 4) bludgeoning damage. If the target is a creature against which the knight has sworn vengeance, the target takes an extra 14 (4d6) bludgeoning damage. Instead of dealing damage, the knight can grapple the target (escape DC 14+1d6 + 11) provided the target is Large or smaller.",
        "Vengeful Glare": "The knight targets one creature it can see within 30 feet of it and against which it has sworn vengeance. The target must make a DC 15+1d6 + 12 Wisdom saving throw. On a failure, the target is paralyzed until the knight deals damage to it, or until the end of the knight's next turn. When the paralysis ends, the target is frightened of the knight for 1 minute. The frightened target can repeat the saving throw at the end of each of its turns, with disadvantage if it can see the knight, ending the frightened condition on itself on a success."
    },
    "alignment": "LE",
    "size": "Medium",
    "type": "undead"
}