{
    "tags": [],
    "strength": "11",
    "dexterity": "16",
    "constitution": "16",
    "intelligence": "20",
    "wisdom": "14",
    "charisma": "16",
    "arcana": "+19",
    "history": "+12",
    "insight": "+9",
    "perception": "+9",
    "name": "Lich",
    "HP": "135 (18d8 + 54)",
    "AC": 17,
    "speed": [
        "30 ft"
    ],
    "saving_throws": {
        "constitution": "proficient",
        "intelligence": "proficient",
        "wisdom": "proficient"
    },
    "skills": {
        "arcana": "expert",
        "history": "proficient",
        "insight": "proficient",
        "perception": "proficient"
    },
    "damage_immunities": [
        "poison",
        "bludgeoning, piercing, and slashing from nonmagical\n            attacks"
    ],
    "resistances": [
        "cold, lightning, necrotic"
    ],
    "condition_immunities": [
        "charmed, exhaustion, frightened, paralyzed, poisoned"
    ],
    "senses": [
        "truesight 120 ft.",
        "passive Perception 19"
    ],
    "languages": [
        "Common plus up to five other languages"
    ],
    "CR": "21 (33,000 XP) or 22 (41,000 XP) whe ecoutered i lair",
    "page": 202,
    "book": "Monster Manual",
    "traits": {
        "Legendary Resistance (3/Day)": "If the lich fails a saving throw, it can choose to succeed instead.",
        "Rejuvenation": "If it has a phylactery, a destroyed lich gains a new body in 1d10 days, regaining all its hit points and becoming active again. The new body appears within 5 feet of the phylactery.",
        "spellcasting": {
            "level": 18,
            "type": "wizard",
            "spells": [
                "mage hand",
                "prestidigitation",
                "ray of frost",
                "detect magic",
                "magic missile",
                "shield",
                "thunderwave",
                "detect thoughts",
                "invisibility",
                "Melf's acid arrow",
                "mirror image",
                "animate dead",
                "counterspell",
                "dispel magic",
                "fireball",
                "blight",
                "dimension door",
                "cloudkill",
                "scrying",
                "disintegrate",
                "globe of                                    invulnerability",
                "finger of death",
                "plane shift",
                "dominate monster",
                "power word stun",
                "power word kill"
            ]
        },
        "Turn Resistance": "The lich has advantage on saving throws against any effect that turns undead."
    },
    "actions": {
        "Paralyzing Touch": "Melee Spell Attack: +12+1d14 + 5 to hit, reach 5 ft., one creature. Hit: 10 (3d6) cold damage. The target must succeed on a DC 18+1d14 + 11 Constitution saving throw or be paralyzed for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
    },
    "legendary_actions": {
        "number": 3,
        "options": {
            "Cantrip": " The lich casts a cantrip.",
            "Paralyzing Touch (Costs 2 Actions)": " The lich uses its Paralyzing Touch.",
            "Frightening Gaze (Costs 2 Actions)": " The lich fixes its gaze on one creature it can see within 10 feet of it. The target must succeed on a DC 18+1d14 + 11 Wisdom saving throw against this magic or become frightened for 1 minute. The frightened target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a target's saving throw is successful or the effect ends for it, the target is immune to the lich's gaze for the next 24 hours.",
            "Disrupt Life (Costs 3 Actions)": " Each non-undead creature within 20 feet of the lich must make a DC 18+1d14 + 11 Constitution saving throw against this magic, taking 21 (6d6) necrotic damage on a failed save, or half as much damage on a successful one."
        }
    },
    "in_lair": {
        "CR_increase": 1,
        "actions": [
            "The lich rolls a d8 and regains a spell slot of that level or lower. If it has no spent spell slots of that level or lower, nothing happens.",
            "The lich targets one creature it can see within 30 feet of it. A crackling cord of negative energy tethers the lich to the target. Whenever the lich takes damage, the target must make a DC 18+1d14 + 11 Constitution saving throw. On a failed save, the lich takes half the damage (rounded down), and the target takes the remaining damage. This tether lasts until initiative count 20 on the next round or until the lich or the target is no longer in the lich's lair.",
            "The lich calls forth the spirits of creatures that died in its lair. These apparitions materialize and attack one creature that the lich can see within 60 feet of it. The target must succeed on a DC 18+1d14 + 11 Constitution saving throw, taking 52 (15d6) necrotic damage on a failed save, or half as much damage on a success. The apparitions then disappear."
        ]
    },
    "alignment": "AEA",
    "size": "Medium",
    "type": "undead"
}