{
    "tags": [
        "demon"
    ],
    "strength": "14",
    "dexterity": "17",
    "constitution": "12",
    "intelligence": "11",
    "wisdom": "12",
    "charisma": "15",
    "deception": "+5",
    "name": "Maurezhi",
    "AC": 15,
    "speed": [
        "30 ft"
    ],
    "saving_throws": {},
    "skills": {
        "deception": "proficient"
    },
    "damage_immunities": [
        "poison"
    ],
    "resistances": [
        "cold, fire, lightning, necrotic",
        "bludgeoning, piercing, and slashing from nonmagical attacks"
    ],
    "condition_immunities": [
        "charmed, exhaustion, poisoned"
    ],
    "senses": [
        "darkvision 120 ft.",
        "passive Perception 11"
    ],
    "languages": [
        "Abyssal",
        "Elvish",
        "telepathy 120 ft."
    ],
    "CR": "7 (2,900 XP)",
    "page": 133,
    "book": "Mordenkainen\\xe2\\x80\\x99s Tome of Foes",
    "traits": {
        "Assume Form": "The maurezhi can assume the appearance of any Medium humanoid it has eaten. It remains in this form for 1d6 days, during which time the form gradually decays until, when the effect ends, the form sloughs from the demon's body.",
        "Magic Resistance": "The maurezhi has advantage on saving throws against spells and other magical effects."
    },
    "actions": {
        "Multiattack": "The maurezhi makes two attacks: one with its bite and one with its claws.",
        "Bite": "Melee Weapon Attack: +6+1d6 + 3 to hit, reach 5 ft., one target. Hit: 14 (2d10 + 3) piercing damage. If the target is a humanoid, its Charisma score is reduced by 1d4. This reduction lasts until the target finishes a short or long rest. The target dies if this reduces its Charisma to 0. It rises 24 hours later as a ghoul, unless it has been revived or its corpse has been destroyed.",
        "Claws": "Melee Weapon Attack: +6+1d6 + 3 to hit, reach 5 ft., one target. Hit: 12 (2d8 + 3) slashing damage. If the target is a creature other than an undead, it must succeed on a DC 12+1d6 + 9 Constitution saving throw or be paralyzed for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.",
        "Raise Ghoul (Recharge 5xe2x80x936)": "The maurezhi targets one dead ghoul or ghast it can see within 30 feet of it. The target is revived with all its hit points."
    },
    "legendary_actions": {
        "number": 0,
        "options": {}
    },
    "alignment": "CE",
    "size": "Medium",
    "type": "fiend"
}