{
    "tags": [],
    "strength": "16",
    "dexterity": "18",
    "constitution": "12",
    "intelligence": "19",
    "wisdom": "13",
    "charisma": "14",
    "deception": "+4",
    "insight": "+3",
    "perception": "+3",
    "stealth": "+6",
    "name": "Mind Drinker Vampire",
    "AC": 14,
    "speed": [
        "30 ft",
        "fly 30 ft. (hover)"
    ],
    "saving_throws": {
        "dexterity": "proficient",
        "intelligence": "proficient",
        "wisdom": "proficient"
    },
    "skills": {
        "deception": "proficient",
        "insight": "proficient",
        "perception": "proficient",
        "stealth": "proficient"
    },
    "resistances": [
        "necrotic"
    ],
    "senses": [
        "darkvision 60 ft.",
        "passive Perception 13"
    ],
    "languages": [
        "the languages it knew in life"
    ],
    "CR": "4 (1,100 XP)",
    "page": 224,
    "book": "Guildmasters\\xe2\\x80\\x99 Guide to Ravnica",
    "traits": {
        "spellcasting": {
            "type": "innate",
            "spells": [
                "message",
                "charm person",
                "hold person",
                "mirror image",
                "sleep",
                "gaseous form",
                "major image"
            ]
        },
        "Shadow Stealth": "While in dim light or darkness, the vampire can take the Hide action as a bonus action.",
        "Sunlight Sensitivity": "While in sunlight, the vampire has disadvantage on attack rolls, as well as on Wisdom (Perception) checks that rely on sight."
    },
    "actions": {
        "Multiattack": "The vampire makes two attacks, only one of which can be a bite attack.",
        "Bite": "Melee Weapon Attack: +6+1d4 + 4 to hit, reach 5 ft., one willing creature, or a creature that is grappled by the vampire, incapacitated, or restrained. Hit: 7 (1d6 + 4) piercing damage plus 7 (2d6) necrotic damage. The target's hit point maximum is reduced by an amount equal to the necrotic damage taken, and the vampire regains hit points equal to that amount. The reduction lasts until the target finishes a long rest. The target dies if its hit point maximum is reduced to 0.",
        "Unarmed Strike": "Melee Weapon Attack: +6+1d4 + 4 to hit, reach 5 ft., one target. Hit: 8 (1d8 + 4) bludgeoning damage. The vampire can also grapple the target (escape DC 13+1d4 + 11) if it is a creature and the vampire has a hand free.",
        "Mind Siphon (Recharge 5xe2x80x936)": "The vampire targets a creature it can see within 30 feet of it. The target must make a DC 14+1d4 + 12 Intelligence saving throw, with disadvantage if the vampire has previously consumed the target's blood. On a failed save, the target takes 28 (8d6) psychic damage, and the vampire discerns the target's surface emotions and thoughts. On a successful save, the target takes half as much damage, and the vampire discerns the target's general emotional state but not its thoughts."
    },
    "legendary_actions": {
        "number": 0,
        "options": {}
    },
    "alignment": "NE",
    "size": "Medium",
    "type": "undead"
}