{
    "tags": [],
    "strength": "27",
    "dexterity": "7",
    "constitution": "21",
    "intelligence": "3",
    "wisdom": "16",
    "charisma": "12",
    "name": "Neothelid",
    "AC": 16,
    "speed": [
        "30 ft"
    ],
    "saving_throws": {
        "intelligence": "proficient",
        "wisdom": "proficient",
        "charisma": "proficient"
    },
    "skills": {},
    "senses": [
        "blindsight 120 ft.",
        "passive Perception 13"
    ],
    "languages": [
        "\\xe2\\x80\\x94"
    ],
    "CR": "13 (10,000 XP)",
    "page": 181,
    "book": "Volo\\xe2\\x80\\x99s Guide to Monsters",
    "traits": {
        "Creature Sense": "The neothelid is aware of the presence of creatures within 1 mile of it that have an Intelligence score of 4 or higher. It knows the distance and direction to each creature, as well as each creature's Intelligence score, but can't sense anything else about it. A creature protected by a mind blank spell, a nondetection spell, or similar magic can't be perceived in this manner.",
        "spellcasting": {
            "type": "innate",
            "spells": [
                "levitate",
                "confusion",
                "feeblemind",
                "telekinesis"
            ]
        },
        "Magic Resistance": "The neothelid has advantage on saving throws against spells and other magical effects."
    },
    "actions": {
        "Tentacles": "Melee Weapon Attack: +13+1d10 + 8 to hit, reach 15 ft., one target. Hit: 21 (3d8 + 8) bludgeoning damage plus 13 (3d8) psychic damage. If the target is a Large or smaller creature, it must succeed on a DC 18+1d10 + 13 Strength saving throw or be swallowed by the neothelid. A swallowed creature is blinded and restrained, it has total cover against attacks and other effects outside the neothelid, and it takes 35 (10d6) acid damage at the start of each of the neothelid's turns.",
        "Acid Breath (Recharge 5xe2x80x936)": "The neothelid exhales acid in a 60-foot cone. Each creature in that area must make a DC 18+1d10 + 13 Dexterity saving throw, taking 35 (10d6) acid damage on a failed save, or half as much damage on a successful one."
    },
    "legendary_actions": {
        "number": 0,
        "options": {}
    },
    "alignment": "CE",
    "size": "Gargantuan",
    "type": "aberration"
}