{
    "tags": [
        "devil"
    ],
    "strength": "18",
    "dexterity": "12",
    "constitution": "20",
    "intelligence": "12",
    "wisdom": "10",
    "charisma": "12",
    "deception": "+5",
    "perception": "+2",
    "stealth": "+5",
    "name": "Nergaliid",
    "HP": "42 (4d10 + 20)",
    "AC": 12,
    "speed": [
        "30 ft"
    ],
    "saving_throws": {},
    "skills": {
        "deception": "expert",
        "perception": "proficient",
        "stealth": "expert"
    },
    "damage_immunities": [
        "fire, poison"
    ],
    "resistances": [
        "cold",
        "bludgeoning, piercing, and slashing from nonmagical attacks that aren\\'t silvered"
    ],
    "condition_immunities": [
        "poisoned"
    ],
    "senses": [
        "darkvision 120 ft.",
        "passive Perception 12"
    ],
    "languages": [
        "Common",
        "Infernal"
    ],
    "CR": "3 (700 XP)",
    "page": 296,
    "book": "Explorer\\xe2\\x80\\x99s Guide to Wildemount",
    "traits": {
        "Shadow Stealth": "While in dim light or darkness, the nergaliid can take the Hide action as a bonus action.",
        "Standing Leap": "The nergaliid's long jump is up to 30 feet and its high jump is up to 20 feet, with or without a running start."
    },
    "actions": {
        "Bite": "Melee Weapon Attack: +6+1d4 + 4 to hit, reach 5 ft., one creature. Hit: 13 (2d8 + 4) piercing damage, and the target must succeed on a DC 15+1d4 + 13 Constitution saving throw or become poisoned for 1 minute. The poisoned creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.",
        "Tongue Lash": "Melee Weapon Attack: +6+1d4 + 4 to hit, reach 20 ft., one target. Hit: 10 (1d12 + 4) bludgeoning damage.",
        "Siphon Life (Recharge 4xe2x80x936)": "The nergaliid magically draws the life from a humanoid it can see within 40 feet of it. The target must make a DC 15+1d4 + 13 Wisdom saving throw. An incapacitated target fails the save automatically. On a failed save, the creature takes 10 (3d6) psychic damage, and the nergaliid gains temporary hit points equal to the damage taken. On a successful save, the target takes half as much damage, and the nergaliid doesn't gain temporary hit points. If this damage kills the target, its body rises at the end of the nergaliid's current turn as a husk zombie (see earlier in this chapter)."
    },
    "alignment": "LE",
    "size": "Large",
    "type": "fiend"
}