{
    "tags": [
        "demon"
    ],
    "strength": "27",
    "dexterity": "14",
    "constitution": "25",
    "intelligence": "20",
    "wisdom": "20",
    "charisma": "25",
    "arcana": "+13",
    "perception": "+13",
    "name": "Orcus",
    "HP": "405 (30d12 + 210)",
    "AC": 17,
    "speed": [
        "40 ft",
        "fly 40 ft"
    ],
    "saving_throws": {
        "dexterity": "proficient",
        "constitution": "proficient",
        "wisdom": "proficient"
    },
    "skills": {
        "arcana": "proficient",
        "perception": "proficient"
    },
    "damage_immunities": [
        "necrotic, poison",
        "bludgeoning, piercing, and slashing from nonmagical attacks"
    ],
    "resistances": [
        "cold, fire, lightning"
    ],
    "condition_immunities": [
        "charmed, exhaustion, frightened, poisoned"
    ],
    "senses": [
        "truesight 120 ft.",
        "passive Perception 22"
    ],
    "languages": [
        "all",
        "telepathy 120 ft."
    ],
    "CR": "26 (90,000 XP)",
    "page": 153,
    "book": "Mordenkainen\\xe2\\x80\\x99s Tome of Foes",
    "traits": {
        "spellcasting": {
            "ability": "charisma",
            "type": "innate",
            "spells": {
                "at will": [
                    "chill touch",
                    "detect magic"
                ],
                "3/day": [
                    "create undead",
                    "dispel magic"
                ],
                "1/day": [
                    "time stop"
                ]
            }
        },
        "Legendary Resistance (3/Day)": "If Orcus fails a saving throw, he can choose to succeed instead.",
        "Magic Resistance": "Orcus has advantage on saving throws against spells and other magical effects.",
        "Magic Weapons": "Orcus's weapon attacks are magical.",
        "Master of Undeath": "When Orcus casts animate dead or create undead, he chooses the level at which the spell is cast, and the creatures created by the spells remain under his control indefinitely. Additionally, he can cast create undead even when it isn't night.",
        "Wand of Orcus": "The wand has 7 charges, and any of its properties that require a saving throw have a save DC of 18. While holding it, Orcus can use an action to cast animate dead, blight, or speak with dead. Alternatively, he can expend 1 or more of the wand's charges to cast one of the following spells from it: circle of death (1 charge), finger of death (1 charge), or power word kill (2 charges). The wand regains 1d4 + 3 charges daily at dawn."
    },
    "actions": {
        "Multiattack": "Orcus makes two Wand of Orcus attacks.",
        "Wand of Orcus": "Melee Weapon Attack: +19+1d16 + 11 to hit, reach 10 ft., one target. Hit: 21 (3d8 + 8) bludgeoning damage plus 13 (2d12) necrotic damage.",
        "Tail": "Melee Weapon Attack: +16+1d16 + 8 to hit, reach 10 ft., one target. Hit: 21 (3d8 + 8) piercing damage plus 9 (2d8) poison damage."
    },
    "legendary_actions": {
        "number": 3,
        "options": {
            "Tail": " Orcus makes one tail attack.",
            "A Taste of Undeath": " Orcus casts chill touch (17th level).",
            "Creeping Death (Costs 2 Actions)": " Orcus chooses a point on the ground that he can see within 100 feet of him. A cylinder of swirling necrotic energy 60 feet tall and with a 10-foot radius rises from that point and lasts until the end of Orcus's next turn. Creatures in that area have vulnerability to necrotic damage."
        }
    },
    "in_lair": {
        "CR_increase": 1,
        "actions": [
            "Orcus's voice booms throughout the lair. His utterance causes one creature of his choice to be subjected to power word kill. Orcus needn't see the creature, but he must be aware that the individual is in the lair.",
            "Orcus causes up to six corpses within the lair to rise as skeletons, zombies, or ghouls. These undead obey his telepathic commands, which can reach anywhere in the lair.",
            "Orcus causes skeletal arms to rise from an area on the ground in a 20-foot square that he can see. They last until the next initiative count 20. Each creature in that area when the arms appear must succeed on a DC 23+1d16 + 15 Strength saving throw or be restrained until the arms disappear or until Orcus releases their grasp (no action required)."
        ]
    },
    "alignment": "CE",
    "size": "Huge",
    "type": "fiend"
}