{
    "tags": [],
    "strength": "19",
    "dexterity": "26",
    "constitution": "25",
    "intelligence": "2",
    "wisdom": "21",
    "charisma": "18",
    "name": "Phoenix",
    "HP": "175 (10d20 + 70)",
    "AC": 18,
    "speed": [
        "20 ft",
        "fly 120 ft"
    ],
    "saving_throws": {
        "wisdom": "proficient",
        "charisma": "proficient"
    },
    "skills": {},
    "damage_immunities": [
        "fire, poison"
    ],
    "resistances": [
        "bludgeoning, piercing, and slashing from nonmagical attacks"
    ],
    "condition_immunities": [
        "exhaustion, grappled, paralyzed, petrified, poisoned, prone, restrained, stunned"
    ],
    "senses": [
        "darkvision 60 ft.",
        "passive Perception 15"
    ],
    "languages": [
        "\\xe2\\x80\\x94"
    ],
    "CR": "16 (15,000 XP)",
    "page": 199,
    "book": "Mordenkainen\\xe2\\x80\\x99s Tome of Foes",
    "traits": {
        "Fiery Death and Rebirth": "When the phoenix dies, it explodes. Each creature within 60-feet of it must make a DC 20+1d10 + 15 Dexterity saving throw, taking 22 (4d10) fire damage on a failed save, or half as much damage on a successful one. The fire ignites flammable objects in the area that aren't worn or carried.",
        "Fire Form": "The phoenix can move through a space as narrow as 1 inch wide without squeezing. Any creature that touches the phoenix or hits it with a melee attack while within 5 feet of it takes 5 (1d10) fire damage. In addition, the phoenix can enter a hostile creature's space and stop there. The first time it enters a creature's space on a turn, that creature takes 5 (1d10) fire damage. With a touch, the phoenix can also ignite flammable objects that aren't worn or carried (no action required).",
        "Flyby": "The phoenix doesn't provoke opportunity attacks when it flies out of an enemy's reach.",
        "Illumination": "The phoenix sheds bright light in a 60-foot radius and dim light for an additional 30 feet.",
        "Legendary Resistance (3/Day)": "If the phoenix fails a saving throw, it can choose to succeed instead.",
        "Siege Monster": "The phoenix deals double damage to objects and structures."
    },
    "actions": {
        "Multiattack": "The phoenix makes two attacks: one with its beak and one with its fiery talons.",
        "Beak": "Melee Weapon Attack: +13+1d10 + 8 to hit, reach 15 ft., one target. Hit: 15 (2d6 + 8) fire damage. If the target is a creature or a flammable object, it ignites. Until a creature takes an action to douse the fire, the target takes 5 (1d10) fire damage at the start of each of its turns.",
        "Fiery Talons": "Melee Weapon Attack: +13+1d10 + 8 to hit, reach 15 ft., one target. Hit: 17 (2d8 + 8) fire damage."
    },
    "legendary_actions": {
        "number": 3,
        "options": {
            "Peck": " The phoenix makes one beak attack.",
            "Move": " The phoenix moves up to its speed.",
            "Swoop (Costs 2 Actions)": " The phoenix moves up to its speed and attacks with its fiery talons."
        }
    },
    "alignment": "N",
    "size": "Gargantuan",
    "type": "elemental"
}