{
    "tags": [
        "devil"
    ],
    "strength": "23",
    "dexterity": "16",
    "constitution": "19",
    "intelligence": "14",
    "wisdom": "15",
    "charisma": "19",
    "intimidation": "+10",
    "perception": "+8",
    "name": "Red Abishai",
    "AC": 22,
    "speed": [
        "30 ft",
        "fly 50 ft"
    ],
    "saving_throws": {
        "strength": "proficient",
        "constitution": "proficient",
        "wisdom": "proficient"
    },
    "skills": {
        "intimidation": "proficient",
        "perception": "proficient"
    },
    "damage_immunities": [
        "fire, poison"
    ],
    "resistances": [
        "cold",
        "bludgeoning, piercing, and slashing from nonmagical attacks that aren\\'t silvered"
    ],
    "condition_immunities": [
        "poisoned"
    ],
    "senses": [
        "darkvision 120 ft.",
        "passive Perception 18"
    ],
    "languages": [
        "Draconic",
        "Infernal",
        "telepathy 120 ft."
    ],
    "CR": "19 (22,000 XP)",
    "page": 160,
    "book": "Mordenkainen\\xe2\\x80\\x99s Tome of Foes",
    "traits": {
        "Devil's Sight": "Magical darkness doesn't impede the abishai's darkvision.",
        "Magic Resistance": "The abishai has advantage on saving throws against spells and other magical effects.",
        "Magic Weapons": "The abishai's weapon attacks are magical."
    },
    "actions": {
        "Multiattack": "The abishai can use its Frightful Presence. It also makes three attacks: one with its morningstar, one with its claw, and one with its bite.",
        "Morningstar": "Melee Weapon Attack: +12+1d12 + 6 to hit, reach 5 ft., one target. Hit: 10 (1d8 + 6) piercing damage.",
        "Claw": "Melee Weapon Attack: +12+1d12 + 6 to hit, reach 5 ft., one target. Hit: 17 (2d10 + 6) slashing damage.",
        "Bite": "Melee Weapon Attack: +12+1d12 + 6 to hit, reach 5 ft., one target. Hit: 22 (3d10 + 6) piercing damage plus 38 (7d10) fire damage.",
        "Frightful Presence": "Each creature of the abishai's choice that is within 120 feet and aware of it must succeed on a DC 18+1d12 + 12 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the abishai's Frightful Presence for the next 24 hours.",
        "Incite Fanaticism": "The abishai chooses up to four of its allies within 60 feet of it that can see it. For 1 minute, each of those allies makes attack rolls with advantage and can't be frightened.",
        "Power of the Dragon Queen": "The abishai targets one dragon it can see within 120 feet of it. The dragon must make a DC 18+1d12 + 12 Charisma saving throw. A chromatic dragon makes this save with disadvantage. On a successful save, the target is immune to the abishai's Power of the Dragon Queen for 1 hour. On a failed save, the target is charmed by the abishai for 1 hour. While charmed in this way, the target regards the abishai as a trusted friend to be heeded and protected. This effect ends if the abishai or its companions deal damage to the target."
    },
    "legendary_actions": {
        "number": 0,
        "options": {}
    },
    "alignment": "LE",
    "size": "Medium",
    "type": "fiend"
}