{
    "tags": [],
    "strength": "16",
    "dexterity": "13",
    "constitution": "16",
    "intelligence": "12",
    "wisdom": "12",
    "charisma": "13",
    "name": "Sea Hag",
    "HP": "52 (7d8 + 21)",
    "AC": 14,
    "speed": [
        "30 ft",
        "swim 40 ft"
    ],
    "saving_throws": {},
    "skills": {},
    "senses": [
        "darkvision 60 ft.",
        "passive Perception 11"
    ],
    "languages": [
        "Aquan",
        "Common",
        "Giant"
    ],
    "CR": "2 (450 XP) or 4 (1,100 XP) whe part of a cove",
    "page": 179,
    "book": "Monster Manual",
    "traits": {
        "Amphibious": "The hag can breathe air and water.",
        "Horrific Appearance": "Any humanoid that starts its turn within 30 feet of the hag and can see the hag's true form must make a DC 11+1d4 + 9 Wisdom saving throw. On a failed save, the creature is frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, with disadvantage if the hag is within line of sight, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the hag's Horrific Appearance for the next 24 hours."
    },
    "actions": {
        "Claws": "Melee Weapon Attack: +5+1d4 + 3 to hit, reach 5 ft., one target. Hit: 10 (2d6 + 3) slashing damage.",
        "Death Glare": "The hag targets one frightened creature she can see within 30 feet of her. If the target can see the hag, it must succeed on a DC 11+1d4 + 9 Wisdom saving throw against this magic or drop to 0 hit points.",
        "Illusory Appearance": "The hag covers herself and anything she is wearing or carrying with a magical illusion that makes her look like an ugly creature of her general size and humanoid shape. The effect ends if the hag takes a bonus action to end it or if she dies."
    },
    "in_lair": {
        "CR_increase": 1,
        "actions": [
            "Until initiative count 20 on the next round, the hag can pass through solid walls, doors, ceilings, and floors as if the surfaces weren't there.",
            "The hag targets any number of doors and windows that she can see, causing each one to either open or close as she wishes. Closed doors can be magically locked (requiring a successful DC 20+1d4 + 18 Strength check to force open) until she chooses to make them unlocked, or until she uses this lair action again to open them.",
            "The hag fills up to four 10-foot cubes of water with ink. The inky areas are heavily obscured for 1 minute, although a steady, strong underwater current disperses the ink on initiative count 10. The hag ignores the obscuring effect of the ink.",
            "The hag chooses one humanoid within the lair and instantly creates a simulacrum of that creature (as if created with the simulacrum spell). This hideous simulacrum is formed out of seaweed, slime, half-eaten fish, and other garbage, but still generally resembles the creature it is imitating. This simulacrum obeys the hag's commands and is destroyed on initiative count 20 on the next round."
        ]
    },
    "alignment": "CE",
    "size": "Medium",
    "type": "fey"
}