{
    "tags": [],
    "strength": "19",
    "dexterity": "15",
    "constitution": "16",
    "intelligence": "12",
    "wisdom": "12",
    "charisma": "18",
    "deception": "+8",
    "insight": "+5",
    "perception": "+5",
    "stealth": "+6",
    "name": "Sea Fury",
    "HP": "105 (14d8 + 42)",
    "AC": 14,
    "speed": [
        "30 ft",
        "swim 50 ft"
    ],
    "saving_throws": {},
    "skills": {
        "deception": "proficient",
        "insight": "proficient",
        "perception": "proficient",
        "stealth": "proficient"
    },
    "damage_immunities": [
        "cold, fire, poison",
        "bludgeoning, piercing, and slashing from nonmagical attacks that aren't silvered"
    ],
    "condition_immunities": [
        "paralyzed, poisoned"
    ],
    "senses": [
        "darkvision 120 ft.",
        "passive Perception 15"
    ],
    "languages": [
        "Aquan",
        "Common",
        "Giant"
    ],
    "CR": "12 (8,400 XP) or 14 (11,500 XP) whe ecoutered i lair",
    "page": 299,
    "book": "Explorer\\xe2\\x80\\x99s Guide to Wildemount",
    "traits": {
        "Amphibious": "The sea fury can breathe air and water.",
        "spellcasting": {
            "type": "innate",
            "spells": [
                "witch bolt",
                "bestow curse",
                "fear",
                "thunderwave"
            ]
        },
        "Legendary Resistance (3/Day)": "If the sea fury fails a saving throw, it can choose to succeed instead.",
        "Magic Resistance": "The sea fury has advantage on saving throws against spells and other magical effects."
    },
    "actions": {
        "Multiattack": "The sea fury makes two attacks with its claws.",
        "Claws": "Melee Weapon Attack: +8+1d8 + 4 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) slashing damage.",
        "Death Glare": "The sea fury targets one frightened creature it can see within 30 feet of it. The target must succeed on a DC 16+1d8 + 12 Wisdom saving throw or drop to 0 hit points."
    },
    "legendary_actions": {
        "number": 3,
        "options": {
            "As Water": " The sea fury transforms into a wave of foaming seawater, along with whatever it is wearing or carrying, and moves up to its speed without provoking opportunity attacks. While in this form, it can't be grappled or restrained. It reverts to its true form at the end of this movement.",
            "Fearsome Apparition (Costs 2 Actions)": " The sea fury conjures an apparition of one of its dead sisters, which appears in an unoccupied space the sea fury can see within 30 feet of it. Enemies of the sea fury that can see the apparition must succeed on a DC 16+1d8 + 12 Wisdom saving throw or be frightened of it until it vanishes at the end of the sea fury's next turn.",
            "Conjure Snakes (Costs 3 Actions)": " The sea fury disgorges a swarm of poisonous snakes, which occupies the same space as the sea fury, acts on its own initiative count, and attacks as directed by the sea fury. The sea fury can control up to three of these swarms at a time."
        }
    },
    "in_lair": {
        "CR_increase": 1,
        "actions": [
            "Caverns, tunnels, and pools of water within 120 feet of the sea fury become foggy or murky, to the extent that the area becomes heavily obscured.",
            "The sea fury conjures a 15-foot cube of water that fills an unoccupied space it can see within 30 feet of it, then moves the water in a straight line up to 60 feet, after which the water disperses. Any creature that comes into contact with the rushing wave must succeed on a DC 16+1d8 + 12 Strength saving throw or be knocked prone by it and pushed 15 feet along its course.",
            "The sea fury calls forth the spirit of a dead sailor or sea hag that met its end in the lair. This spirit has the statistics of a specter and lasts until the sea fury uses another lair action. The specter appears in an unoccupied space within 30 feet of the sea fury and obeys the sea fury's commands."
        ]
    },
    "alignment": "CE",
    "size": "Medium",
    "type": "fey"
}