{
    "tags": [
        "demon"
    ],
    "strength": "10",
    "dexterity": "3",
    "constitution": "23",
    "intelligence": "25",
    "wisdom": "24",
    "charisma": "25",
    "arcana": "+13",
    "history": "+13",
    "perception": "+13",
    "name": "Sibriex",
    "HP": "150 (12d12 + 72)",
    "AC": 19,
    "speed": [
        "0 ft",
        "fly 20 ft. (hover)"
    ],
    "saving_throws": {
        "intelligence": "proficient",
        "charisma": "proficient"
    },
    "skills": {
        "arcana": "proficient",
        "history": "proficient",
        "perception": "proficient"
    },
    "damage_immunities": [
        "poison"
    ],
    "resistances": [
        "cold, fire, lightning",
        "bludgeoning, piercing, and slashing from nonmagical attacks"
    ],
    "condition_immunities": [
        "poisoned"
    ],
    "senses": [
        "truesight 120 ft.",
        "passive Perception 23"
    ],
    "languages": [
        "all",
        "telepathy 120 ft."
    ],
    "CR": "18 (20,000 XP)",
    "page": 137,
    "book": "Mordenkainen\\xe2\\x80\\x99s Tome of Foes",
    "traits": {
        "Contamination": "The sibriex emits an aura of corruption 30 feet in every direction. Plants that aren't creatures wither in the aura, and the ground in it is difficult terrain for other creatures. Any creature that starts its turn in the aura must succeed on a DC 20+1d12 + 14 Constitution saving throw or take 14 (4d6) poison damage. A creature that succeeds on the save is immune to this sibriex's Contamination for 24 hours.",
        "spellcasting": {
            "type": "innate",
            "spells": [
                "charm person",
                "command",
                "dispel magic",
                "hold monster",
                "feeblemind"
            ]
        },
        "Legendary Resistance (3/Day)": "If the sibriex fails a saving throw, it can choose to succeed instead.",
        "Magic Resistance": "The sibriex has advantage on saving throws against spells and other magical effects."
    },
    "actions": {
        "Multiattack": "The sibriex uses Squirt Bile once and makes three attacks using its chain, bite, or both.",
        "Chain": "Melee Weapon Attack: +6+1d12 + 0 to hit, reach 15 ft., one target. Hit: 20 (2d12 + 7) piercing damage.",
        "Bite": "Melee Weapon Attack: +6+1d12 + 0 to hit, reach 5 ft., one target. Hit: 9 (2d8) piercing damage plus 9 (2d8) acid damage.",
        "Squirt Bile": "The sibriex targets one creature it can see within 120 feet of it. The target must succeed on a DC 20+1d12 + 14 Dexterity saving throw or take 35 (10d6) acid damage.",
        "Warp Creature": "The sibriex targets up to three creatures it can see within 120 feet of it. Each target must make a DC 20+1d12 + 14 Constitution saving throw. On a successful save, a creature becomes immune to this sibriex's Warp Creature. On a failed save, the target is poisoned, which causes it to also gain 1 level of exhaustion. While poisoned in this way, the target must repeat the saving throw at the start of each of its turns. Three successful saves against the poison end it, and ending the poison removes any levels of exhaustion caused by it. Each failed save causes the target to suffer another level of exhaustion. Once the target reaches 6 levels of exhaustion, it dies and instantly transforms into a living abyssal wretch under the sibriex's control. The transformation of the body can be undone only by a wish spell."
    },
    "legendary_actions": {
        "number": 3,
        "options": {
            "Cast a Spell": " The sibriex casts a spell.",
            "Spray Bile": " The sibriex uses Squirt Bile.",
            "Warp (Costs 2 Actions)": " The sibriex uses Warp Creature."
        }
    },
    "alignment": "CE",
    "size": "Huge",
    "type": "fiend"
}