{
    "tags": [
        "stone"
    ],
    "strength": "23",
    "dexterity": "14",
    "constitution": "21",
    "intelligence": "10",
    "wisdom": "8",
    "charisma": "12",
    "athletics": "+14",
    "perception": "+3",
    "name": "Stone Giant Dreamwalker",
    "HP": "161 (14d12 + 70)",
    "AC": 18,
    "speed": [
        "40 ft"
    ],
    "saving_throws": {
        "dexterity": "proficient",
        "constitution": "proficient",
        "wisdom": "proficient"
    },
    "skills": {
        "athletics": "expert",
        "perception": "proficient"
    },
    "condition_immunities": [
        "charmed, frightened"
    ],
    "senses": [
        "darkvision 60 ft.",
        "passive Perception 13"
    ],
    "languages": [
        "Common",
        "Giant"
    ],
    "CR": "10 (5,900 XP)",
    "page": 150,
    "book": "Volo\\xe2\\x80\\x99s Guide to Monsters",
    "traits": {
        "Dreamwalker's Charm": "An enemy that starts its turn within 30 feet of the giant must make a DC 13+1d8 + 9 Charisma saving throw, provided that the giant isn't incapacitated. On a failed save, the creature is charmed by the giant. A creature charmed in this way can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. Once it succeeds on the saving throw, the creature is immune to this giant's Dreamwalker's Charm for 24 hours."
    },
    "actions": {
        "Multiattack": "The giant makes two attacks with its greatclub.",
        "Greatclub": "Melee Weapon Attack: +10+1d8 + 6 to hit, reach 15 ft., one target. Hit: 19 (3d8 + 6) bludgeoning damage.",
        "Petrifying Touch": "The giant touches one Medium or smaller creature within 10 feet of it that is charmed by it. The target must make a DC 17+1d8 + 13 Constitution saving throw. On a failed save, the target becomes petrified, and the giant can adhere the target to its stony body. Greater restoration spells and other magic that can undo petrification have no effect on a petrified creature on the giant unless the giant is dead, in which case the magic works normally, freeing the petrified creature as well as ending the petrified condition on it.",
        "Rock": "Ranged Weapon Attack: +10+1d8 + 6 to hit, range 60/240 ft., one target. Hit: 28 (4d10 + 6) bludgeoning damage. If the target is a creature, it must succeed on a DC 17+1d8 + 13 Strength saving throw or be knocked prone."
    },
    "alignment": "CN",
    "size": "Huge",
    "type": "giant"
}