{
    "tags": [
        "titan"
    ],
    "strength": "30",
    "dexterity": "11",
    "constitution": "29",
    "intelligence": "22",
    "wisdom": "11",
    "charisma": "10",
    "name": "Tromokratis",
    "AC": 22,
    "speed": [
        "30 ft",
        "swim 80 ft"
    ],
    "saving_throws": {
        "intelligence": "proficient",
        "wisdom": "proficient"
    },
    "skills": {},
    "damage_immunities": [
        "fire",
        "bludgeoning, piercing, and slashing from nonmagical attacks"
    ],
    "resistances": [
        "cold, lightning, thunder"
    ],
    "condition_immunities": [
        "charmed, frightened, paralyzed, restrained"
    ],
    "senses": [
        "blindsight 120 ft.",
        "passive Perception 10"
    ],
    "languages": [
        "\\xe2\\x80\\x94"
    ],
    "CR": "26 (90,000 XP, or 180,000 XP as a mythic encounter)",
    "page": 254,
    "book": "Mythic Odysseys of Theros",
    "traits": {
        "Amphibious": "Tromokratis can breathe air and water.",
        "Hearts of the Kraken (Mythic Trait; Recharges after a Short or Long Rest)": "When Tromokratis is reduced to 0 hit points, it doesn't die or fall unconscious. Instead, the damage creates cracks in its carapace, revealing its hearts. Tromokratis has four hearts: two on its chest, one on its back, and one at the base of its tail. A heart has an AC of 22 and 100 hit points. It is immune to bludgeoning, piercing, and slashing damage from nonmagical attacks, and it is immune to all conditions. If it is forced to make a saving throw, treat its ability scores as 10 (+0). If it finishes a short or long rest, the carapace heals, any destroyed hearts regenerate, and the hearts are covered again. Tromokratis dies when all the hearts are destroyed.",
        "Legendary Resistance (3/Day)": "If Tromokratis fails a saving throw, it can choose to succeed instead.",
        "Magic Weapons": "Tromokratis\\'s weapon attacks are magical.",
        "Siege Monster": "Tromokratis deals double damage to objects and structures.",
        "Spell-Resistant Carapace": "Tromokratis has advantage on saving throws against spells, and any creature that makes a spell attack against Tromokratis has disadvantage on the attack roll."
    },
    "alignment": "AA",
    "size": "Gargantuan",
    "type": "monstrosity"
}