{
    "tags": [
        "shapechanger"
    ],
    "strength": "18",
    "dexterity": "18",
    "constitution": "18",
    "intelligence": "17",
    "wisdom": "15",
    "charisma": "18",
    "perception": "+7",
    "stealth": "+9",
    "name": "Vampire",
    "AC": 16,
    "speed": [
        "30 ft"
    ],
    "saving_throws": {
        "dexterity": "proficient",
        "wisdom": "proficient",
        "charisma": "proficient"
    },
    "skills": {
        "perception": "proficient",
        "stealth": "proficient"
    },
    "resistances": [
        "necrotic",
        "bludgeoning, piercing, and slashing from nonmagical attacks"
    ],
    "senses": [
        "darkvision 120 ft.",
        "passive Perception 17"
    ],
    "languages": [
        "the languages it knew in life"
    ],
    "CR": "13 (10,000 XP)",
    "page": 297,
    "book": "Monster Manual",
    "traits": {
        "Shapechanger": "If the vampire isn't in sunlight or running water, it can use its action to polymorph into a Tiny bat or a Medium cloud of mist, or back into its true form.",
        "Legendary Resistance (3/Day)": "If the vampire fails a saving throw, it can choose to succeed instead.",
        "Misty Escape": "When it drops to 0 hit points outside its resting place, the vampire transforms into a cloud of mist (as in the Shapechanger trait) instead of falling unconscious, provided that it isn't in sunlight or running water. If it can't transform, it is destroyed.",
        "Regeneration": "The vampire regains 20 hit points at the start of its turn if it has at least 1 hit point and isn't in sunlight or running water. If the vampire takes radiant damage or damage from holy water, this trait doesn't function at the start of the vampire's next turn.",
        "Spider Climb": "The vampire can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check.",
        "Vampire Weaknesses": "The vampire has the following flaws:"
    },
    "actions": {
        "Multiattack (Vampire Form Only)": "The vampire makes two attacks, only one of which can be a bite attack.",
        "Unarmed Strike (Vampire Form Only)": "Melee Weapon Attack: +9+1d10 + 4 to hit, reach 5 ft., one creature. Hit: 8 (1d8 + 4) bludgeoning damage. Instead of dealing damage, the vampire can grapple the target (escape DC 18+1d10 + 13).",
        "Bite (Bat or Vampire Form Only)": "Melee Weapon Attack: +9+1d10 + 4 to hit, reach 5 ft., one willing creature, or a creature that is grappled by the vampire, incapacitated, or restrained. Hit: 7 (1d6 + 4) piercing damage plus 10 (3d6) necrotic damage. The target's hit point maximum is reduced by an amount equal to the necrotic damage taken, and the vampire regains hit points equal to that amount. The reduction lasts until the target finishes a long rest. The target dies if this effect reduces its hit point maximum to 0. A humanoid slain in this way and then buried in the ground rises the following night as a vampire spawn under the vampire's control.",
        "Charm": "The vampire targets one humanoid it can see within 30 feet of it. If the target can see the vampire, the target must succeed on a DC 17+1d10 + 12 Wisdom saving throw against this magic or be charmed by the vampire. The charmed target regards the vampire as a trusted friend to be heeded and protected. Although the target isn't under the vampire's control, it takes the vampire's requests or actions in the most favorable way it can, and it is a willing target for the vampire's bite attack.",
        "Children of the Night (1/Day)": "The vampire magically calls 2d4 swarms of bats or rats, provided that the sun isn't up. While outdoors, the vampire can call 3d6 wolves instead. The called creatures arrive in 1d4 rounds, acting as allies of the vampire and obeying its spoken commands. The beasts remain for 1 hour, until the vampire dies, or until the vampire dismisses them as a bonus action."
    },
    "legendary_actions": {
        "number": 3,
        "options": {
            "Move": " The vampire moves up to its speed without provoking opportunity attacks.",
            "Unarmed Strike": " The vampire makes one unarmed strike.",
            "Bite (Costs 2 Actions)": " The vampire makes one bite attack."
        }
    },
    "alignment": "LE",
    "size": "Medium",
    "type": "undead"
}